{"87kudm": {"subreddit": "r/ethtrader", "id": "87kudm", "text": "", "permalink": "/r/ethtrader/comments/87kudm/kauri_the_knowledge_network_for_the_ethereum/", "title": "Kauri: The Knowledge Network for the Ethereum Ecosystem", "created_utc": 1522175406.0, "url": "https://media.consensys.net/kauri-the-knowledge-network-for-the-ethereum-ecosystem-bccc80c0f3ab", "author": "jdbender66"}, "87ln85": {"subreddit": "r/ethereum", "id": "87ln85", "text": "", "permalink": "/r/ethereum/comments/87ln85/advertise_ethereum_on_my_website/", "title": "Advertise ETHEREUM on my website.", "created_utc": 1522181009.0, "url": "https://cryptopiece.com/", "author": "CryptoPieceCom"}, "87j9e7": {"subreddit": "r/ethtrader", "id": "87j9e7", "text": "", "permalink": "/r/ethtrader/comments/87j9e7/funfair_fun_new_website_and_updated_roadmap/", "title": "Funfair (FUN) new website and updated roadmap", "created_utc": 1522164179.0, "url": "https://funfair.io/", "author": "IGVUK"}, "87j14l": {"subreddit": "r/ethtrader", "id": "87j14l", "text": "", "permalink": "/r/ethtrader/comments/87j14l/shivomsomix_token_sale_is_the_first_time_backers/", "title": "Shivom’sOmiX token sale is the first time backers can hedge their contribution risk as a result of partnership with decentralized risk hedging platform DeHedge", "created_utc": 1522162381.0, "url": "https://www.globalbankingandfinance.com/shivom-token-sale-contributors-can-benefit-from-hedging-in-worlds-first-hedged-token/", "author": "Alba-Ruthenian"}, "87fh4s": {"subreddit": "r/ethtrader", "id": "87fh4s", "text": "Do you think right now is good time to invest in Ethereum? If so, How can I do it? Through which platform.\n\nSomeone said that last two years is a right time to invest in Ethereum and right now it's also. Is that person correct?", "permalink": "/r/ethtrader/comments/87fh4s/should_i_invest_100_into_ethereum_now/", "title": "Should I invest 100$ into Ethereum now?", "created_utc": 1522123088.0, "url": "https://www.reddit.com/r/ethtrader/comments/87fh4s/should_i_invest_100_into_ethereum_now/", "author": "GTHell"}, "87hbmf": {"subreddit": "r/ethereum", "id": "87hbmf", "text": "", "permalink": "/r/ethereum/comments/87hbmf/coinbase_erc20_coinbase_adds_erc20_support/", "title": "Coinbase ERC20 : Coinbase Adds ERC20 Support", "created_utc": 1522146411.0, "url": "https://www.bitguru.co.uk/coinbase-adds-erc20-support/", "author": "myluxurybed"}, "87immc": {"subreddit": "r/ethereum", "id": "87immc", "text": "", "permalink": "/r/ethereum/comments/87immc/upcoming_event_listing_on_cryptology_march_28_2018/", "title": "Upcoming Event: Listing on Cryptology - March 28, 2018", "created_utc": 1522159257.0, "url": "https://kryptocal.com/event/15781/listing-on-cryptology", "author": "cryptocalbot"}, "87iiwd": {"subreddit": "r/ethtrader", "id": "87iiwd", "text": "Welcome to this week’s Terrible Token Tuesdays! Join hands with us as we dive deep into the impractical, unscrupulous, and sometimes hilarious world of cryptocurrency startups. Whether we are dealing with MLM ponzis, unregistered securities, or Blockchain 4.0 snake oil, our #SOMO (Satisfaction Of Missing Out) does not discriminate. Please Enjoy!\n\n\nModex - https://concourseq.io/Q/Modex Centralised project, using blockchain for no real-reasons, while creating a token that is not really needed. Will collect fees amounting to 30% of each code sale, which is almost if not more than most current \nIntermediaries.\n\nConcierge - https://concourseq.io/Q/Concierge A Neo-native rebrand of their previously attempted unsuccessful Conciergecoin on Ethereum. The project has sold to the public under the branding of Pre-sale the same tokens at a 60% discount in February. The Token is not needed, and creates an additional layer of complexity on the platform while just acting as a funding vehicle for the team.\n\nPRETHER - https://concourseq.io/Q/PRETHER A crypto-currency backed with precious metals, with a CEO that has no previous experience, and a CIO who is a full time traveler. Website lists testimonials by Queen Elizabeth II and Ghandi, while one of the two advisors seems to be family related to the CEO.\n\nElementh - https://concourseq.io/Q/Elementh - The Same team has conducted a failed ICO (Ahoolee) for a somewhat similar idea “Search Engine for products” and their product was supposed to launch in Dec 2017. Questionable value for the token since the platform will accept any cryptocurrency. \n\nBit Nautic - https://concourseq.io/Q/BitNautic A CEO who is still at University wants to buy a fleet of cargo ships, create a decentralised shipping platform and launch a debit card (blockchain fund-raising FTW, i guess). The Company that aims to cover all those fields was just registered to a flat in Jan 2018.\n\nParsec Frontiers - https://concourseq.io/Q/Parsec_Frontiers - Proposes to create a huge MMO game on the blockchain, while trying to combine Ethereum and “a private chain” without any blockchain development talent on the team.\n\nFaima - https://concourseq.io/Q/Faima - Whitepaper is advertising 722% gains and full of grammatical errors, typos and informal slang, making it look like it was run through an online translator. People that can’t proofread a whitepaper rarely produce mad gainz.\n\nHYCON - https://concourseq.io/Q/HYCON - DAG based Infrastructure project with no code on Github! The team does not seem to be very proficient with the project documentation, and no have verifiable Blockchain track record for a project of this magnitude.\n\nBubbletone - https://concourseq.io/Q/Bubbletone - Touting their 4 months old Bubbletonel app, which is a standard internet instant messaging and calling app that has nothing to do with the scope of the project! The founders previous project (which does not seem to have taken off) was the same idea they are doing now without blockchain, possibly signaling that blockchain is not really necessary for the project.\n\nDiet Bitcoin https://concourseq.io/Q/Diet_Bitcoin - A Bitcoin fork by Pablo Escobar’s brother. We’d tell you more, but we want you to click the link.\n\nThe ConcourseQ team would like to thank everybody that helped on these DDs and all the others! If you want to join our community, meet us on our [Discord](https://discord.gg/YuWfcnY) \n", "permalink": "/r/ethtrader/comments/87iiwd/terrible_token_tuesdays_10_icos_only_a_mother/", "title": "Terrible Token Tuesdays - 10 ICOs only a mother could love", "created_utc": 1522158357.0, "url": "https://www.reddit.com/r/ethtrader/comments/87iiwd/terrible_token_tuesdays_10_icos_only_a_mother/", "author": "snasps"}, "87iidc": {"subreddit": "r/ethtrader", "id": "87iidc", "text": "", "permalink": "/r/ethtrader/comments/87iidc/the_golem_project_brass_golem_alpha2_0140/", "title": "The Golem Project - Brass Golem Alpha2 0.14.0", "created_utc": 1522158218.0, "url": "https://blog.golemproject.net/brass-golem-alpha2-0-14-0-182db913ed3e", "author": "rammsteinPL"}, "87k9rm": {"subreddit": "r/ethtrader", "id": "87k9rm", "text": "", "permalink": "/r/ethtrader/comments/87k9rm/auctus_token_sale_is_live_auctus/", "title": "Auctus Token Sale is live! – Auctus", "created_utc": 1522171365.0, "url": "https://medium.com/auctus/auctus-token-sale-is-live-5a3321df5702", "author": "bbrock171"}, "87g5js": {"subreddit": "r/ethtrader", "id": "87g5js", "text": "Welcome to the Daily General Discussion thread of /r/EthTrader.\n\n***\n\nThread guidelines:\n\n-  Please refrain from discussing non-Ethereum related tokens here. You are welcome to discuss altcoins in the Daily Altcoin Discussion thread.\n-  All [sub rules](https://www.reddit.com/r/ethtrader/about/rules/) apply here so please be familiar with them.\n\n***\n\n Resources and other information:\n\n* Newcomers who have basic questions about Ethereum can find answers by visiting /r/EthereumNoobies or our Ethereum Education wiki page, [see here](https://www.reddit.com/r/ethtrader/wiki/education).\n\n* To view live streaming comments for this thread, [click here](https://reddit-stream.com/comments/auto).  Account permissions are required to post comments through Reddit-Stream.com.\n\n***\n\nEnjoy!\n", "permalink": "/r/ethtrader/comments/87g5js/daily_general_discussion_march_27_2018/", "title": "Daily General Discussion - March 27, 2018", "created_utc": 1522131064.0, "url": "https://www.reddit.com/r/ethtrader/comments/87g5js/daily_general_discussion_march_27_2018/", "author": "AutoModerator"}, "87okl4": {"subreddit": "r/ethtrader", "id": "87okl4", "text": "I suspect the futures market brings massive price manipulation. Just take a look at the Gold and Silver market. Is it possible for Ethereum Foundation to forbid creation of ETH futures by any entity?", "permalink": "/r/ethtrader/comments/87okl4/disallow_futures_on_eth/", "title": "Disallow futures on ETH", "created_utc": 1522205648.0, "url": "https://www.reddit.com/r/ethtrader/comments/87okl4/disallow_futures_on_eth/", "author": "mycnyc"}, "87jt7e": {"subreddit": "r/ethereum", "id": "87jt7e", "text": "", "permalink": "/r/ethereum/comments/87jt7e/uport_on_any_ethereum_blockchain_why_uport/", "title": "uPort on any Ethereum blockchain: Why uPort Supports Multiple Networks & Application Accounts", "created_utc": 1522168173.0, "url": "https://medium.com/uport/uport-on-any-ethereum-blockchain-c54368a12e8c", "author": "jdbender66"}, "87jh6q": {"subreddit": "r/ethereum", "id": "87jh6q", "text": "", "permalink": "/r/ethereum/comments/87jh6q/dapp_the_chibi_fighters_have_been_released/", "title": "[Dapp] The Chibi fighters have been released", "created_utc": 1522165794.0, "url": "https://chibifighters.io/referral.php?id=5", "author": "Jensanko"}, "87itci": {"subreddit": "r/ethereum", "id": "87itci", "text": "", "permalink": "/r/ethereum/comments/87itci/coinbase_to_support_ethereum_erc20_assets/", "title": "Coinbase To Support Ethereum ERC20 Assets", "created_utc": 1522160700.0, "url": "https://www.btcnn.com/coinbase-to-support-ethereum-erc20-assets/", "author": "linzerdshaffen"}, "87o3w8": {"subreddit": "r/ethtrader", "id": "87o3w8", "text": "(disclaimer English is my 2nd language). I am a 33 married male living in San Diego currently making about 50k a year. So, I made my first purchase back in May, it was only for a couple hundred bucks. Back at that time, I had been investing in stocks for about five years. I had a total of 50k invested in all sorts of tech stocks. A few days later I bought my very first eth purchase at $130 with a credit card. I was trying to buy as much as I could, I was not afraid. in a matter of days I had a few thousand bucks. I was mainly buying eth. Eth shot up to $400 and suddenly realized that I had made over 30% gains (on average).\n\nThen, the ICO crash came, my guts where wrenching day by day, but ethtrader kept me sane, I learn to hodl like a pro and buy the dips. I started buying and buying more and eventually is started going up as soon as the bitcoin fork dilemma passed after August 1st. I took out money from a line of credit, I sold my netflix stock to buy more eth and alts. I had sold about 30k of stocks and put it all on eth. I saw btc go up and my eth and alts trading sideways. Another leason for me, do not under estimate bitcoin. It pissed me off that me and all my alts was being outperformed by noobs in coinbase simply holding btc. My portfolio was on the Red. Btc was sucking on everything.\n\nThen the ICO ban china news came and was I even more on the red, about -25% or probably more . But for some reason, I was not afraid, I knew it was going to go up eventually. I maybe had around 60k at that moment. Because I learned the lesson to never underestimate bitcoin. I later bought some more bitcoin and soon experience the btc and bch close flipping. I sold all my bch as soon as I got it on Bitfinex for about $500. Then the bch attack on btc happened and It was again gut wrenching as my portfolio was close to being on the red again, but it never did. I sold some btc for bch during the crisis.\n\nAfter the bch/btc dilemma, I sold all of my remaining stocks and went all in into cryoto to buy as much bitcoin as I could before the S2X fork - I wanted the free s2x coins. I was a good choice, btc was going up and going up and alts and eth was down. my porfolio grew slightly though. I splitted my btc for b2x futures in Bitfinex (bt1 and bt2) and sold all of the bt2 (b2x futures) for about .17 btc. Great move because the fork was cancelled and I was able to sell the futures. My porfolio started going up and going up. I started doing some arbitrage between exchanges, sometimes I would make a few hundred buck a day other days only 20 bucks.\n\nBy late November early December I broke the 100k. I could not believe I had 100k ( six figures!) and in a matter of only a few weeks. I originally wanted 100k for a down payment on a home in San Diego. I started looking for a 200k down payment and tell my wife to quit her job and go back to school. Hodling finally paid off, patience finally paid off. I was in mania! At that time, I decided not to check my balance anymore. It was too stressful, everyday I would gain or lose more than what I would make in months at my job. I stopped buying crypto because it was a few hundred bucks was going to make an impact on 300k. At that time was thinking of cashing out, but short term capital gains where going to kill me - paying over 45% in taxes! I had over 30 coin in total scattered all over the place. I had dozens of wallets and dozens of private keys neatly organized. I started buying stuff on craigslist with bitcoin directly. I was able to buy a mountain bike for .5 ether, my first and only crypto purchase so far.\n\nAt that time, around first week of January, alts and btc dropped but my ether and other coins kept my portfolio close to the 400k range. I decided to move all my coins to Bitfinex in order to sell if I really needed to. The following day, boom it crashes down to $13,000. Here is where I make a series of mistakes, while it dropped to $13k I started selling to at least keep my down payment needed for the house. I cashed out 200k in USDT and keep about 80k invested. The next day, I regretted that decision and bought my way in again. Well, in a few days it dropped down to $12k. I sold again, I sold only 150k need for my down payment (a smaller downpayment) and only keept about 50k invested. I then realized, that I had too much invested. I bought in with 50k so that left me with 100k USDT in Bitfinex. I was 100k cash an 100k invested. I later bought another 50k thinking that it was bottom. Mistake, I got a 10k loan when eth was around $800 thinking it was bottom. I was trying to catch a falling knife and I bleed hard.\n\nIn the next few days, I found out that was wife was pregnant. That changed everything, I meant that I could no longer continue to live with my inlaws and be patient and invest. I needed to move out and buy the house when the baby was going to able to walk. The baby is due in August, and hopefully I will able to move out in December. In the end, today it was my last straw. I sold most of investments and kept only 100k USDT and about 35k in a variety of crypto fund from Iconomi. I am definitely on the green, but now, living in San Diego I am having a hard time finding a home based on my income (average house price is over 500k!) Anyways, I guess my main tip to everyone is: Have fixed, measurable goals and stick to them. I had my moon and decided to go for the damn galaxy. I will finally be able to sleep at night, and not have to check my blockfolio every second. I am sorry for the awful grammar and spelling. I don't know how to format property. Feel free to ask me anything. (my cryptocompare portfolio is public for anyone to see by looking my username)\n\nEdit: 3/27/2018: some many edits due to grammar\n\nP.D: I finally got my Trezor Model-T I had ordered back in November. Too late.\n", "permalink": "/r/ethtrader/comments/87o3w8/i_am_out_guys_ethtrader_tought_me_to_holdbut_ive/", "title": "I am out guys. ethtrader tought me to hold,but I've had enough. Here is my story...", "created_utc": 1522201321.0, "url": "https://www.reddit.com/r/ethtrader/comments/87o3w8/i_am_out_guys_ethtrader_tought_me_to_holdbut_ive/", "author": "richyboycaldo"}, "87ebmc": {"subreddit": "r/ethereum", "id": "87ebmc", "text": "", "permalink": "/r/ethereum/comments/87ebmc/why_youll_be_hearing_a_lot_about_securities_tokens/", "title": "Why You’ll Be Hearing A Lot About Securities Tokens", "created_utc": 1522111984.0, "url": "https://blog.polymath.network/why-youll-be-hearing-a-lot-about-securities-tokens-4086b7c87f80", "author": "laplings"}, "87k9ul": {"subreddit": "r/ethereum", "id": "87k9ul", "text": "", "permalink": "/r/ethereum/comments/87k9ul/auctus_token_sale_is_live_auctus/", "title": "Auctus Token Sale is live! – Auctus", "created_utc": 1522171381.0, "url": "https://medium.com/auctus/auctus-token-sale-is-live-5a3321df5702", "author": "bbrock171"}, "87hl0n": {"subreddit": "r/ethereum", "id": "87hl0n", "text": "", "permalink": "/r/ethereum/comments/87hl0n/loads_of_exciting_news_for_streamr_this_march/", "title": "Loads of exciting news for Streamr this March! Streamr's CEO, Henri, tells all in Transmission #5", "created_utc": 1522149426.0, "url": "https://youtu.be/r-XIIh8-xBw", "author": "AmandineF"}, "87fi2u": {"subreddit": "r/ethereum", "id": "87fi2u", "text": "", "permalink": "/r/ethereum/comments/87fi2u/erc20_token_standard_on_coinbase_could_be_big/", "title": "ERC20 Token Standard on CoinBase.... could be big!", "created_utc": 1522123367.0, "url": "https://walletinvestor.com/magazine/coinbase-announced-their-intention-to-support-the-ethereum-erc20-token-standard-in-the-near-future/", "author": "PaidByCoins"}, "87kkhn": {"subreddit": "r/ethereum", "id": "87kkhn", "text": "", "permalink": "/r/ethereum/comments/87kkhn/dharma_community_update_welcome_chris_min/", "title": "Dharma Community Update: Welcome Chris Min, Developer Update, Joining BSIC", "created_utc": 1522173501.0, "url": "https://blog.dharma.io/dharma-community-update-welcome-chris-min-developer-update-joining-bsic-b0b1d253a572", "author": "dharmaprotocol"}, "87nizq": {"subreddit": "r/ethtrader", "id": "87nizq", "text": "", "permalink": "/r/ethtrader/comments/87nizq/update_elix_boost_video_demo_adds_support_for/", "title": "[UPDATE] ELIX Boost Video Demo, Adds Support For Ether Crowdfunding", "created_utc": 1522196048.0, "url": "https://medium.com/@elixirtoken/support-for-ether-crowdfunding-boost-video-demo-and-creator-portal-55cdeb86adaf", "author": "cryptoredditr"}, "87g158": {"subreddit": "r/ethereum", "id": "87g158", "text": "", "permalink": "/r/ethereum/comments/87g158/drops_of_diamond_sharding_development_update/", "title": "Drops of Diamond sharding development update", "created_utc": 1522129547.0, "url": "https://medium.com/@james.ray/development-update-9f742514324f", "author": "jamescray1"}, "87gi7d": {"subreddit": "r/ethereum", "id": "87gi7d", "text": "I have a use case where I want a Smart Contract to hold a secret (most likely a decryption key for a file) that should be revealed only if a certain event occurs. So at first the key cannot be seen until an oracle (consider this as given) lets the contract know that it should reveal the it.\n\nNow I guess there is no way (yet) of doing that on the ethereum main chain as everything is transparent and there cannot be something like a private variable that no one can read, right?\n\nWould this be possible on a private/permissioned chain?\n\nAny thoughts are appreciated.\nThanks. :)", "permalink": "/r/ethereum/comments/87gi7d/smart_contract_revealing_a_secret_on_occurrance/", "title": "Smart Contract Revealing a Secret on Occurrance of Certain Event?", "created_utc": 1522135507.0, "url": "https://www.reddit.com/r/ethereum/comments/87gi7d/smart_contract_revealing_a_secret_on_occurrance/", "author": "pachisi456"}, "87iw27": {"subreddit": "r/ethtrader", "id": "87iw27", "text": "I have created a website that displays major coin events like test net release, main net release, coin burns, beta/alpha release etc. \n\nYou can check it out at http://lymni.com ", "permalink": "/r/ethtrader/comments/87iw27/i_created_a_website_that_shows_major_upcoming/", "title": "I created a website that shows major upcoming coin events", "created_utc": 1522161292.0, "url": "https://www.reddit.com/r/ethtrader/comments/87iw27/i_created_a_website_that_shows_major_upcoming/", "author": "mask45"}, "87kabd": {"subreddit": "r/ethereum", "id": "87kabd", "text": "", "permalink": "/r/ethereum/comments/87kabd/kees_de_vos_ceo_of_mobilebridge_discusses_the/", "title": "Kees de Vos, CEO of MobileBridge, discusses the importance of Capturing ‘value’ in Marketing", "created_utc": 1522171473.0, "url": "https://medium.com/@keesdevosNL/capturing-value-in-marketing-358de4244f63", "author": "shon_film"}, "87jle9": {"subreddit": "r/ethereum", "id": "87jle9", "text": "", "permalink": "/r/ethereum/comments/87jle9/can_you_recommend_me_a_good_and_up_to_date/", "title": "Can you recommend me a good and up to date Solidity tutorial?", "created_utc": 1522166671.0, "url": "https://www.reddit.com/r/ethereum/comments/87jle9/can_you_recommend_me_a_good_and_up_to_date/", "author": "cryptohazard"}, "87l0jv": {"subreddit": "r/ethtrader", "id": "87l0jv", "text": "", "permalink": "/r/ethtrader/comments/87l0jv/auctus_labs_empowering_the_community_through/", "title": "Auctus Labs — Empowering The Community Through Decentralization", "created_utc": 1522176689.0, "url": "https://hackernoon.com/auctus-labs-empowering-the-community-through-decentralization-13d908716c61", "author": "ludylops"}, "87l97u": {"subreddit": "r/ethereum", "id": "87l97u", "text": "", "permalink": "/r/ethereum/comments/87l97u/polymath_partners_with_crowd_machine_to_boost/", "title": "Polymath Partners With Crowd Machine To Boost Adoption Of Security Tokens", "created_utc": 1522178348.0, "url": "https://blog.polymath.network/polymath-partners-with-crowd-machine-to-boost-adoption-of-security-tokens-82eb100e7c08", "author": "Snuffiegurl87"}, "87ltlw": {"subreddit": "r/ethereum", "id": "87ltlw", "text": "", "permalink": "/r/ethereum/comments/87ltlw/mindscom_running_its_boosting_system_on_a/", "title": "Minds.com running its boosting system on a ethereum testnet :)", "created_utc": 1522182243.0, "url": "https://www.minds.com/newsfeed/825431153868296192", "author": "GeneralAsthar"}, "87ebsw": {"subreddit": "r/ethereum", "id": "87ebsw", "text": "Food Raptor is a project that started out as a centralized organization built to compete with GrubHub & DoorDash for the Detroit market. It failed and I spent some time away from the project to think about strategy. During this time I used GrubHub and DoorDash and it became very clear what their weakness was... themselves. Fees and commissions littered across the entire process, carefully calculated to provide GrubHub & DoorDash with strong returns at the expense of the customer and food establishments. All while the driver is receiving just enough to make it worth their time as a side-gig. \n\nThat's when it clicked. I'll just take Food Raptor out of Food Raptor. Eliminate the middle-man through utilization of smart contracts and provide incentive for all actors facilitate long-term improvement and moderation of the platform.\n\nBelow I go over the advantages I have identified that a DAO platform has over a centralized organization for food establishments (providers), deliverers (vehicles), and customers. The concepts below present an extremely simplified narrative of platform requirements for development, execution, and long-term continuity. Please take that into consideration when reviewing. The purpose of sharing this information is to begin building a community to support and further determine, evaluate requirements, and develop this project.\n\nThe documentation includes all of the information below and may be easier to read: https://foodraptor.com/Food-Raptor-White-Paper-v1.0.1.pdf\n\n**ADVANTAGES**\n\n**FOOD ESTABLISHMENTS**\n\nUnlike centralized food delivery services, there is no charge to receive orders through Food Raptor. Utilization of the Food Raptor application would have no cost for the provider, except for the transaction fees to update core information. To keep transaction costs to a minimum, non-core information will be stored and hosted utilizing a content delivery service such as AWS to provide end user content. Associated content delivery service costs will be absorbed by the order contract initiator (customer). \n\n**INCENTIVE TO PURCHASE FDR**\n\nThe incentive for providers to purchase FDR include:\n\n**Lower the cost of delivery for their customers to make ordering from their establishment more attractive.** \n*FDR can be sent to the provider’s contract and a payout type (fixed or percentage) and rate variable is set to dictate how much FDR will be contributed to each order. \n\n**Promote the visibility of their contract (their establishment) on Food Raptor** \n*FDR can be sent to the provider’s contract and a payout type (PPC or CPM) and rate variable is set to control when this contract is displayed as promoted. \n\n**VEHICLES**\n\nExisting food delivery services currently raise multiple fees and charge both the customer and provider for using their platform.  These costs are compiled as the cost of service. \n\nIn a decentralized organization we are able to remove the margin a centralized organization would take, sometimes as much as a 13.5% commission to the provider and various other charges to the customer. Doing this allows the vehicle to request and earn more for the service performed while lowering the actual cost of delivery for the customer. \n \nINCENTIVE FOR VEHICLES TO CHOOSE FOODRAPTOR\n\nThe Food Raptor delivery system would be open to anyone who has access to the internet. This makes it possible for anyone to sign-up and begin delivering in minutes. \n\nThe Food Raptor System would allow each vehicle to set their own price.\n\nAs mentioned above, by taking out the unnecessary fees charged by centralized organizations, this will allow vehicles to charge higher delivery costs because the overall delivery cost will more closely reflect the amount being paid for the delivery service. \n\n**DECENTRALIZATION EXCEPTIONS**\n\nIn order to provide an experience that can compete with centralized organizations, certain centralized service requirements have been assumed. It is the community and contributing developers' responsibility to ensure that these services, although centralized, are publicly managed and paid. These services include:\n\n**Google Maps API**\n* For tracking vehicle locations.\n\n**Push Notification Supplier [TBD]**\n* For pushing order status notifications between all users.\n\nWHAT ARE VEHICLES?\n\n*The usage of the term vehicle is in regards to the method in which a delivery is fulfilled. This includes human, human controlled, and autonomous methods. *\n\n**CUSTOMERS**\n\nCentralized delivery services charge customers raise fees to use their platform to place orders in order to return a profit. A decentralized organization such as Food Raptor will allow customers to pay less because they are only paying what is required to satisfy content delivery service costs and the vehicle’s minimum requirements. \n\nIn addition, the provider’s usage of FDR drives down the cost of the delivery, and in some cases the cost of delivery for the customer may be completely covered depending on how the provider has configured the award payout and the order total.   \n\n**INCENTIVE FOR CUSTOMERS TO CHOOSE FOODRAPTOR**\n\nThe Food Raptor delivery system does not work to benefit any particular user group, but the system as a whole. This means competition for the customer’s business has a direct positive influence on how much the customer pays for delivery, not how much an organization will profit for promoting a particular user group such as the providers or vehicles.\n\n**INCENTIVE TO PURCHASE FDR**\n\n**Customers must use the FDR to place and pay for orders on Food Raptor.**\n* The USD/FDR exchange process must be seamless and integrated into the dApp checkout to successfully compete with the experience existing centralized services provide. \n\n**SMART CONTRACTS & COST CALCULATIONS**\nProposed functions and relationships are covered in more detail in the documentation: https://foodraptor.com/Food-Raptor-White-Paper-v1.0.1.pdf\n\n**PROPOSED WAGER SYSTEM**\n\nTo build trust between all user groups, vehicles and providers may transfer FDR to their smart contract as a guarantee to the customer. \n\nAny user can claim there is an illegitimate party involved in the order for the order to be deactivated and set the inResolution variable to true. When this function is executed, wager funds are pulled from the vehicle and provider contract if available. \n\nWhen the contract is in resolution, the highest confirmation requirement of all involved parties is used as the actual confirmation. Other third parties will be able to interact with the contract to confirm or deny the claim. The resolution system will tightly correlate to the value of FDR, the wager payout in FDR should persuade contributors to answer with their best judgement to preserve and strengthen the value of the FDR.\n\nAs an award for contributing to the security and trust of the system, confirmation actors receive an equal percentage of the wager remainder. Wager payouts are held for 14 days to further prevent bad actors from quickly or wrongly confirming or denying claims to receive FDR.\n\nWhether the claim is approved or denied will affect the vehicle and providers listing contracts reputation score by updating claimGuilt and claimCount variables on the vehicle or provider contract. \n\n**DISCLOSURE**\nMany unidentified risks and challenges will arise during and post development. Many core requirements and details need to be gathered and evaluated. Many statements, concepts, and suggestions are only partially developed. The proposed timeline is hypothetical and is likely to change. All objectives are hypothetical, some may not be possible to accomplish.\n\nI can't express enough this is a concept and has an immense amount of requirement gathering and evaluation to be completed to truly determine the plausibility of everything mentioned above. \n\n*So what's my angle?*\n\nThe current concept runs off the assumption that funding will be needed to develop this project, although I assume it's possible community contributions could fully develop the project. At this point and time, the proposed method of raising funds is through the sale of the FDR token, and I would like to retain 10% of the FDR. This is not a requirement and I am very flexible on this. If the successful launch of this platform required me to relinquish all FDR, I would do what is necessary to increase the likelihood of project success. By day I am a process development project manager, I am familiar and experienced and skilled in managing agile SDLCs at an enterprise level. I intend on staying the project to facilitate development and preserve the project's initial mission.\n \nTransparency and community will make or break this project. \n\nI look forward to seeing some responses and receiving constructive feedback. Even more so, I look forward to any community interest and involvement to begin shaping this into something amazing. A Slack workspace has been set up to collaborate for now. More information can be found at: https://foodraptor.com/", "permalink": "/r/ethereum/comments/87ebsw/foodraptor_the_food_delivery_dao/", "title": "FoodRaptor - The Food Delivery DAO", "created_utc": 1522112027.0, "url": "https://www.reddit.com/r/ethereum/comments/87ebsw/foodraptor_the_food_delivery_dao/", "author": "intuzu"}, "87ho3y": {"subreddit": "r/ethtrader", "id": "87ho3y", "text": "pls", "permalink": "/r/ethtrader/comments/87ho3y/anyone_have_link_to_the_spreadsheet_showing_ico/", "title": "anyone have link to the spreadsheet showing ICO eth addresses / how much the have sold?", "created_utc": 1522150407.0, "url": "https://www.reddit.com/r/ethtrader/comments/87ho3y/anyone_have_link_to_the_spreadsheet_showing_ico/", "author": "kcorda"}, "87jvs9": {"subreddit": "r/ethtrader", "id": "87jvs9", "text": "", "permalink": "/r/ethtrader/comments/87jvs9/tpl_a_framework_for_secure_kycaml_compliant/", "title": "TPL — A Framework for Secure KYC/AML Compliant Peer-to-Peer Exchange Encoded Smart Contracts.", "created_utc": 1522168688.0, "url": "https://blog.zeppelin.solutions/tpl-a-framework-for-secure-peer-to-peer-exchange-7c69fd0aebc9", "author": "maxmersch"}, "87jnww": {"subreddit": "r/ethereum", "id": "87jnww", "text": "", "permalink": "/r/ethereum/comments/87jnww/deutsche_bãrse_group_wants_to_develop_a/", "title": "Deutsche BÃ¶rse Group Wants to Develop a Blockchain-Based Platform", "created_utc": 1522167151.0, "url": "https://the-blockchain-journal.com/2018/03/27/deutsche-borse-group-wants-to-develop-a-blockchain-based-platform/", "author": "Leaders17"}, "87j0es": {"subreddit": "r/ethereum", "id": "87j0es", "text": "We have just released our newest blog post in which we do a little recap of March and talk about the upcoming player vs player gameplay update!\n https://medium.com/@ChainMonsters/chainmonsters-update-3-and-road-ahead-f7b388917613", "permalink": "/r/ethereum/comments/87j0es/chainmonstersio_adding_player_vs_player_mode_in/", "title": "ChainMonsters.io adding Player vs Player mode in next patch", "created_utc": 1522162233.0, "url": "https://www.reddit.com/r/ethereum/comments/87j0es/chainmonstersio_adding_player_vs_player_mode_in/", "author": "CineTek"}, "87hs0z": {"subreddit": "r/ethtrader", "id": "87hs0z", "text": "", "permalink": "/r/ethtrader/comments/87hs0z/fuck_it_lets_jinx_it_i_want_to_buy_cheaper/", "title": "Fuck it, let's jinx it! I want to buy cheaper.", "created_utc": 1522151602.0, "url": "https://i.imgflip.com/277tzg.jpg", "author": "RealFightfrog"}, "87jzcy": {"subreddit": "r/ethtrader", "id": "87jzcy", "text": "", "permalink": "/r/ethtrader/comments/87jzcy/new_crypto_arbitrage_service/", "title": "new crypto arbitrage service", "created_utc": 1522169448.0, "url": "https://coinspread.org/", "author": "coinspread"}, "87fh35": {"subreddit": "r/ethereum", "id": "87fh35", "text": "One idea I really like about ethereum is it's permanence. Once you put something on the blockchain, it's there forever on hundreds of thousands of computers.\n\nI thought a really cool application of this would be a digital tombstone for my uncle.\n\nI created one here: http://www.mark-kane.com/\n\nIt uses ethereum to store the data permanently in a smart contract that cannot be taken down or removed. I like this more than putting something on facebook and hoping it's there in a few years.", "permalink": "/r/ethereum/comments/87fh35/a_digital_tombstone_for_my_uncle/", "title": "A digital tombstone for my uncle", "created_utc": 1522123071.0, "url": "https://www.reddit.com/r/ethereum/comments/87fh35/a_digital_tombstone_for_my_uncle/", "author": "dumbfoundded"}, "87kdsd": {"subreddit": "r/ethereum", "id": "87kdsd", "text": "", "permalink": "/r/ethereum/comments/87kdsd/uport_community_call_tuesday_april_3rd_1100am_est/", "title": "uPort Community Call 📅 Tuesday April 3rd 11:00am EST - Testing Mainnet Account Support", "created_utc": 1522172150.0, "url": "https://www.uport.me/community-call", "author": "kamescg"}, "87j1ny": {"subreddit": "r/ethereum", "id": "87j1ny", "text": "", "permalink": "/r/ethereum/comments/87j1ny/hi_all_im_a_musician_and_im_interested_in_how_the/", "title": "Hi all ... I’m a musician and I’m interested in how the Ethereum blockchain can help me as an artist. Can anyone point me in the direction of some interesting music related projects. Thanks.", "created_utc": 1522162510.0, "url": "https://www.reddit.com/r/ethereum/comments/87j1ny/hi_all_im_a_musician_and_im_interested_in_how_the/", "author": "robgalloway"}, "87iuxi": {"subreddit": "r/ethereum", "id": "87iuxi", "text": "", "permalink": "/r/ethereum/comments/87iuxi/streamr_update_march_27/", "title": "Streamr update (March 27)", "created_utc": 1522161060.0, "url": "https://www.youtube.com/watch?v=r-XIIh8-xBw&feature", "author": "Eersdfxcv"}, "87k90r": {"subreddit": "r/ethtrader", "id": "87k90r", "text": "Hi,\n\nPhase 1:\nwith my friends we created the first Fork of 0xBitcoin right after it released, we liked the idea that bring PoW in the ERC20 economy.\nAs our fault we made some changes in the difficulty calculation it make PoWEth mining impossible, so we had to go faster to the second phase than we expected.\n\nPhase 2, PoWAdv:\n- As much we like the PoW ERC20 token idea, we have many criticism against it to build a virtual mining economy where it has no security meaning.\nIn our solution, PoW reliable for a constant Token distribution which handled by holders and the community. \n\nOld version:\n- Block reward halved by time.\n- Difficulty adjusted every 1024 block.\n- Network difficulty.\n- GPU,Pool mining support predicted.\n\nNew version:\n- Block reward constant.\n- Difficulty adjusted every 16 block.\n- Personal & Network difficulty.\n- Token Holding and solo mining predicted.\n\nFunction which return your personal difficulty:\n\n     function discountedMiningTarget(address solver) public constant returns (uint256 discountedDiff) {\n        // the number of coins owned\n        uint256 minerBalance = uint256(balanceOf(solver));\n         \n        if(minerBalance <= 2 * _BLOCK_REWARD)\n            return getMiningTarget();\n            \n        // the number of full block rewards owned\n        uint256 minerDiscount = uint256(minerBalance.div(_BLOCK_REWARD));\n            \n        discountedDiff = miningTarget.mul(minerDiscount.mul(minerDiscount));\n        \n        if(discountedDiff > _MAXIMUM_TARGET) //very easy\n            discountedDiff = _MAXIMUM_TARGET;\n      \n        return discountedDiff;\n    }\n\n\nFull contract deployed: https://etherscan.io/address/0x1a136ae98b49b92841562b6574d1f3f5b0044e4c\n\nBitcointalk announcement and more info: https://bitcointalk.org/index.php?topic=3180092.0\n\nP.S.: It was really conducive to prepare the Hardfork and create a new distribution logic. We learn a lot more about Solidity and the whole Eth ecosystem than ever before.", "permalink": "/r/ethtrader/comments/87k90r/powadvpowa_new_pow_distributed_erc20_token/", "title": "PoWAdv(POWA) New PoW distributed ERC20 token.", "created_utc": 1522171208.0, "url": "https://www.reddit.com/r/ethtrader/comments/87k90r/powadvpowa_new_pow_distributed_erc20_token/", "author": "janixwow"}, "87k83k": {"subreddit": "r/ethereum", "id": "87k83k", "text": "Thank you for your support. We still have 21 hours of guaranteed participation for whitelisted contributors. Access https://auctus.org/tokensale/  ", "permalink": "/r/ethereum/comments/87k83k/auctus_soft_cap_reached_in_1_hour/", "title": "Auctus soft cap reached in 1 hour!", "created_utc": 1522171037.0, "url": "https://www.reddit.com/r/ethereum/comments/87k83k/auctus_soft_cap_reached_in_1_hour/", "author": "ludylops"}, "87j3ga": {"subreddit": "r/ethtrader", "id": "87j3ga", "text": "", "permalink": "/r/ethtrader/comments/87j3ga/all_i_can_think_about_whenever_someone_posts_that/", "title": "All I can think about whenever someone posts that “Anatomy of a Bubble” chart", "created_utc": 1522162896.0, "url": "https://imgur.com/a/vvxtR", "author": "TroyStackhouse"}, "87kqmt": {"subreddit": "r/ethereum", "id": "87kqmt", "text": "", "permalink": "/r/ethereum/comments/87kqmt/introducing_the_decentraland_marketplace_for/", "title": "Introducing the Decentraland Marketplace for Mobile", "created_utc": 1522174678.0, "url": "https://blog.decentraland.org/introducing-the-decentraland-marketplace-for-mobile-74a965511205", "author": "raingrove"}, "87nbpi": {"subreddit": "r/ethereum", "id": "87nbpi", "text": "", "permalink": "/r/ethereum/comments/87nbpi/why_i_make_crypto_youtube_videosif_you_havent/", "title": "Why I Make Crypto YouTube Videos....(If you haven't seen my content yet I would love to earn your support!)", "created_utc": 1522194314.0, "url": "https://youtu.be/DWnvk9DDLgo", "author": "adamhillc"}, "87enkx": {"subreddit": "r/ethtrader", "id": "87enkx", "text": "Looks to me like things bottom out at ~$412 around April 20........\n[img]https://i.imgur.com/Om9NBgC.jpg[/img]", "permalink": "/r/ethtrader/comments/87enkx/my_amateur_eth_ta/", "title": "My amateur ETH TA", "created_utc": 1522114983.0, "url": "https://www.reddit.com/r/ethtrader/comments/87enkx/my_amateur_eth_ta/", "author": "concreteblue"}, "87oh4s": {"subreddit": "r/ethtrader", "id": "87oh4s", "text": "", "permalink": "/r/ethtrader/comments/87oh4s/gdax_amount_of_buys_from_400445_is_greater_than/", "title": "GDAX amount of buys from $400-$445 is greater than sells from $445-$700.", "created_utc": 1522204709.0, "url": "https://i.redd.it/p9bp0zzh2fo01.png", "author": "OperationNine"}, "87h0rk": {"subreddit": "r/ethtrader", "id": "87h0rk", "text": "", "permalink": "/r/ethtrader/comments/87h0rk/other_ways_of_earning_from_the_cryptocurrency/", "title": "Other ways of earning from the Cryptocurrency industry", "created_utc": 1522142552.0, "url": "https://crypto-lines.com/2018/03/27/earning-from-the-cryptocurrency-industry/", "author": "hayna_sm"}, "87mqgq": {"subreddit": "r/ethereum", "id": "87mqgq", "text": "", "permalink": "/r/ethereum/comments/87mqgq/hey_all_im_not_new_to_cryptocurrency_but_am_very/", "title": "Hey all! I’m not new to cryptocurrency but am very new to ethereum. Where do you guys think it’ll be in a couple years compared to Bitcoin (market cap wise)?", "created_utc": 1522189258.0, "url": "https://www.reddit.com/r/ethereum/comments/87mqgq/hey_all_im_not_new_to_cryptocurrency_but_am_very/", "author": "MoneroFuture"}, "87k9iz": {"subreddit": "r/ethereum", "id": "87k9iz", "text": "Hi all,\n\nI present Peepeth, a fast and user-friendly microblogging dapp I built that's powered by Ethereum:\n\n**[https://peepeth.com](https://peepeth.com)**\n\nI've built it to be used by a wider (non-crypto) audience. Here are the details:\n\n* **Posting is nearly free & instant.** (Technobabble: uses a stateless contract, IPFS, and batched transactions.)\n\n* **Prove it's you.** Prove ownership of social media accounts via an oracle contract (just Twitter for now).\n\n* **Practical.** Automatically repost to Twitter, get email notifications, use on mobile via Toshi/Cipher/Trust, & more.\n\n\n**Why does this matter?** It's a decentralized and incorruptible alternative to Twitter that's accessible to non-crypto enthusiasts.\n\n\n**Where's it going?** Peepeth could be one of the first widely-used dApps. I plan to add more features, build a mobile app, get a redesign, & make peepeth.org to help others build front-ends.\n\n\n**Revenue model** Peepeth has a public back-end (blockchain+ipfs) and a private front-end (peepeth.com). Currently, the revenue model is charging for social media verification, and taking a percentage of tips. I'm also offering \"Founder\" badges for a short time (donations).\n\n\n**Want to help? Here are a few ways:**\n\n* **Seed Peepeth with great content.** Let's give decentralized social media a good name. \n\n* **Whales only: buy a Founder badge.** I could use your help to make Peepeth mainstream. If Peepeth does get adopted beyond the crypto community, it could help the ecosystem. See peepeth.com/support\n\n* **Offer your advice and suggestions.** Peepeth is a compilation of other peoples' ideas, so please feel free to contribute your strategic and tactical insights.\n\n* **Share with friends & the media.** Especially interested in reaching tech-savvy people outside of crypto.\n\nAs it stands, to sign up you first have to request an invite on the site, and I'll approve them on a rolling basis as I work out potential teething issues.\n\nAll feedback appreciated.\n\nThanks to all who've helped make Peepeth possible!\n\nBevan Barton", "permalink": "/r/ethereum/comments/87k9iz/presenting_peepeth_a_decentralized_alternative_to/", "title": "Presenting Peepeth: a decentralized alternative to Twitter", "created_utc": 1522171317.0, "url": "https://www.reddit.com/r/ethereum/comments/87k9iz/presenting_peepeth_a_decentralized_alternative_to/", "author": "madame_BOV"}, "87kjpu": {"subreddit": "r/ethtrader", "id": "87kjpu", "text": "", "permalink": "/r/ethtrader/comments/87kjpu/enigma_is_holding_an_ama_to_discuss_its_new/", "title": "Enigma is Holding an AMA to Discuss its New Roadmap", "created_utc": 1522173365.0, "url": "https://np.reddit.com/r/enigmacatalyst/comments/87iutr/enigma_roadmap_ama_april_3rd_2018/", "author": "its_part_of_trade"}, "87jfal": {"subreddit": "r/ethtrader", "id": "87jfal", "text": "", "permalink": "/r/ethtrader/comments/87jfal/ethereum_meets_japan_minister_of_foreign_affairs/", "title": "Ethereum meets Japan. Minister of Foreign Affairs @VitalikButerin", "created_utc": 1522165414.0, "url": "https://twitter.com/mi_ayako/status/978658568818708480", "author": "Butta_TRiBot"}, "87ohrj": {"subreddit": "r/ethtrader", "id": "87ohrj", "text": "*And to think the party hasn't even really started.* \n\nI can't count how many times I've seen people say we will not see a new all-time high anytime soon. I think you guys need to get your seatbelts ready. If you're a fan of the tech and you are researching then I'm preaching to the choir. A revolution is starting. It's only been under way since 2009.   It's not going away.  Once you are convinced of that you can relax and start reading and digging in. \n\nPeople in these top-tier teams are really damn excited right now if you take some time to read on their discords and telegrams. \n\n Sure, The price puts a pit in my stomach for a brief second and then when I step back and look at the forest among the trees I feel like I'm right back where I was in 2014 watching the drop of Bitcoin..... remembering thinking to myself that although Bitcoin was Nifty I wanted something *I could do something with.* \n\nNow I'm looking at World governments and institutions finding ways to do something with ETH and related tokens.  Crypto kitties was a genius novelty but now we're getting ready to peg gold, power casino games, get paid by advertisers, Dai stable coins, interact with Dapps and trade tokens on Toshi, and witness the multiple teams flying and flocking alongside core to assist with scaling. And on and on and on.\n\nAnd, yet, I understand why some of you feel like it doesn't matter with all this development.\n\n**Wake up Buttercup.** You are in the middle of a fintech explosion where the most fine tuned applications are going to run under the hood of some of the biggest names on the planet.\n\n40 new EEA members today,  the boss Vitalik meets in Japan, and the flow of news streams in constantly. Fundamentals don't matter.  ETH is second Fiddle and no one understands the music except us. ....Just wait until the pressure of the market sell-off dies out with a whimper.   This sub will be just as loud going up as the wailing and gnashing of teeth has been going down..... \n\nyou guys calling for sub 300. Good luck.   Reminds me a lot of the people calling for $0.50 back when we dropped from $22. It barely fell below $6. Yes it was shocking.... but if you are riding the train all the way down and watching the news coming in back then you'd feel just the same as I do now.  \n\nEveryday I wake up and I'm astonished just how much more is coming along than I ever dreamed I would see in this short of time. I don't think people understand just how many of these tokens are being powered by ETH and what an absolutely massive wave is brewing from the tsunami of 2018.\n\nCheers and big hugs from Kansas City.", "permalink": "/r/ethtrader/comments/87ohrj/massive_heap_of_rhetoric_but_it_needs_to_be_said/", "title": "Massive heap of rhetoric. But it needs to be said.", "created_utc": 1522204882.0, "url": "https://www.reddit.com/r/ethtrader/comments/87ohrj/massive_heap_of_rhetoric_but_it_needs_to_be_said/", "author": "jtnichol"}, "87kcfs": {"subreddit": "r/ethtrader", "id": "87kcfs", "text": "", "permalink": "/r/ethtrader/comments/87kcfs/top_5_questions_about_making_a_profit_with_crypto/", "title": "Top 5 Questions About Making a Profit with Crypto — 10KQA Challenge", "created_utc": 1522171906.0, "url": "https://hackernoon.com/weekly-top-5-questions-about-making-a-profit-with-crypto-10kqa-challenge-602cce953a7e", "author": "ksshilov"}, "87lygc": {"subreddit": "r/ethtrader", "id": "87lygc", "text": "", "permalink": "/r/ethtrader/comments/87lygc/eventum_alpha_to_reward_users_who_submit_their/", "title": "Eventum Alpha to Reward Users Who Submit Their Data", "created_utc": 1522183206.0, "url": "https://medium.com/@jonathan.f.tran/a-comprehensive-guide-to-the-eventum-alpha-a2f9597e7208", "author": "CryptoKool"}, "87i615": {"subreddit": "r/ethtrader", "id": "87i615", "text": "", "permalink": "/r/ethtrader/comments/87i615/shivom_token_sale_contributors_can_benefit_from/", "title": "SHIVOM TOKEN SALE CONTRIBUTORS CAN BENEFIT FROM HEDGING IN WORLD’S FIRST HEDGED TOKEN", "created_utc": 1522155187.0, "url": "https://www.globalbankingandfinance.com/shivom-token-sale-contributors-can-benefit-from-hedging-in-worlds-first-hedged-token/", "author": "mme102"}, "87osl0": {"subreddit": "r/ethtrader", "id": "87osl0", "text": "", "permalink": "/r/ethtrader/comments/87osl0/lunyr_releases_macos_and_linux_desktop_app/", "title": "Lunyr Releases MacOS and Linux Desktop app", "created_utc": 1522207865.0, "url": "https://lunyr.com/downloads", "author": "davgonz90"}, "87i7hr": {"subreddit": "r/ethtrader", "id": "87i7hr", "text": "", "permalink": "/r/ethtrader/comments/87i7hr/ethusd_to_retrace_390_then_target_2850/", "title": "ETH/USD to retrace ~$390, then target $2850", "created_utc": 1522155548.0, "url": "https://i.imgur.com/H2D0A8d.png", "author": "Butta_TRiBot"}, "87og8g": {"subreddit": "r/ethtrader", "id": "87og8g", "text": "", "permalink": "/r/ethtrader/comments/87og8g/coinbase_in_talks_to_acquire_earncom_its_biggest/", "title": "Coinbase in Talks to Acquire Earn.com, Its Biggest Acquisition Ever: Report", "created_utc": 1522204449.0, "url": "https://www.ccn.com/coinbase-in-talks-to-acquire-earn-com-reports/", "author": "BeerBellyFatAss"}, "87j3p7": {"subreddit": "r/ethtrader", "id": "87j3p7", "text": "", "permalink": "/r/ethtrader/comments/87j3p7/dont_you_die_on_me/", "title": "Don’t you die on me!", "created_utc": 1522162944.0, "url": "https://i.redd.it/yhl643aembo01.jpg", "author": "NewEthereumGuy"}, "87iaqk": {"subreddit": "r/ethtrader", "id": "87iaqk", "text": "ETH price ~$1400\n-Ugh I missed the boat, I wish I could have got on board when the price was still around, (Insert desired price point)\n\nETH price ~$450\n-OMG should I sell? Is the world going to end? Is crypto dead!? \n\nDollar cost average your purchases and relax. We all got spoiled last year thinking the market would continue to grow endlessly. Corrections are neccessary. \nCrypto is a long game, take the bumps and bruises In stride and remember why you invested in the first place. \nYou cant lose anything until you sell. \n", "permalink": "/r/ethtrader/comments/87iaqk/pick_one/", "title": "Pick one", "created_utc": 1522156292.0, "url": "https://www.reddit.com/r/ethtrader/comments/87iaqk/pick_one/", "author": "Rle1220b"}, "87lcpc": {"subreddit": "r/ethtrader", "id": "87lcpc", "text": "", "permalink": "/r/ethtrader/comments/87lcpc/polymath_partners_with_crowd_machine_to_boost/", "title": "Polymath Partners With Crowd Machine To Boost Adoption Of Security Tokens", "created_utc": 1522179019.0, "url": "https://blog.polymath.network/polymath-partners-with-crowd-machine-to-boost-adoption-of-security-tokens-82eb100e7c08", "author": "daveleau"}, "87jp2h": {"subreddit": "r/ethereum", "id": "87jp2h", "text": "", "permalink": "/r/ethereum/comments/87jp2h/an_optin_selfregulatory_framework_to_support/", "title": "An opt-in, self-regulatory framework to support formal decentralized economies", "created_utc": 1522167370.0, "url": "https://blog.zeppelin.solutions/tpl-a-framework-for-secure-peer-to-peer-exchange-7c69fd0aebc9", "author": "demibrener"}, "87of8h": {"subreddit": "r/ethtrader", "id": "87of8h", "text": "", "permalink": "/r/ethtrader/comments/87of8h/stateless_payments_for_stateless_people_omisego/", "title": "Stateless payments for stateless people – OmiseGO Network", "created_utc": 1522204206.0, "url": "https://blog.omisego.network/stateless-payments-for-stateless-people-55a4fc323c4e", "author": "BeerBellyFatAss"}, "87g087": {"subreddit": "r/ethtrader", "id": "87g087", "text": "", "permalink": "/r/ethtrader/comments/87g087/thought_i_bought_the_dip_on_sunday/", "title": "Thought I bought the dip on sunday.....", "created_utc": 1522129223.0, "url": "https://i.redd.it/4e6ibsh5u8o01.png", "author": "skywalkermolly"}, "87j2ow": {"subreddit": "r/ethtrader", "id": "87j2ow", "text": "Those are:\n\n- AKN INC.\n- Akropolis Decentralised Ltd\n- Applicature inc\n- Bennett Jones LLP\n- BGX\n- BII\n- Brandting Golv\n- Carl Data Solutions Inc.\n- Colendi Yapay Zeka ve Buyuk Veri Tek Hiz AS\n- Covex Lab Technology Ltd\n- Cryptovation\n- Datum Network GmbH\n- DMarket Limited\n- ecIoTify GmbH\n- FLUX\n- Foris Limited\n- Group Firmitas\n- Horizon State\n- Iposint\n- Jones Day\n- McCarthy Tetrault LLP\n- McDermott Will & Emery LLP\n- Nori LLC\n- RDMCHAIN\n- Schwegman, Lundberg, and Woessner P.A.\n- Smartbridge LLC\n- Sofocle Technologies (OPC) Pvt Ltd\n- STK\n- Thomas Ray Co.\n- TIBCO Software Inc\n- Till Payments\n- TOKENY\n- TrustToken\n- VIMANA GLOBAL Inc.\n- Whiteblock\n- XYOracle Network\n- ZebiData\n", "permalink": "/r/ethtrader/comments/87j2ow/eea_adds_40_new_members/", "title": "EEA adds 40 new members", "created_utc": 1522162737.0, "url": "https://www.reddit.com/r/ethtrader/comments/87j2ow/eea_adds_40_new_members/", "author": "penta314"}, "87lhpc": {"subreddit": "r/ethereum", "id": "87lhpc", "text": "What is the memory storage overhead for a contract.\n\nThat is, all contracts require X amount of bits to function when created and pushed to the chain?\n\n----------------------\n\nI know that:\n\nDeploying an empty contract cost ~68,000 transaction gas.\n\nAt 20,000 gas = 256 bits, this is ~870 bits of data for contract overhead, assuming the entire transaction cost is for storage, and none of the contract creation process is subsidized or overcosted.\n\nIs this correct?\n\n-----------------\nmore specifically, how is this 68,000 cost broken down, and what do the operations mean. \n\nIE: how much data does G_create or G_txcreate write to the chain.", "permalink": "/r/ethereum/comments/87lhpc/contract_memory_overhead/", "title": "Contract memory overhead", "created_utc": 1522179928.0, "url": "https://www.reddit.com/r/ethereum/comments/87lhpc/contract_memory_overhead/", "author": "Titian90"}, "87krq4": {"subreddit": "r/ethtrader", "id": "87krq4", "text": "", "permalink": "/r/ethtrader/comments/87krq4/a_hitchhikers_guide_to_distributed_systems_by/", "title": "A Hitchhiker’s Guide to Distributed Systems - by Storj", "created_utc": 1522174891.0, "url": "https://blog.storj.io/post/172275100478/a-hitchhikers-guide-to-distributed-systems", "author": "cryptobubble"}, "87iip3": {"subreddit": "r/ethereum", "id": "87iip3", "text": "", "permalink": "/r/ethereum/comments/87iip3/brass_golem_alpha2_0140_the_golem_project/", "title": "Brass Golem Alpha2 0.14.0 – The Golem Project", "created_utc": 1522158299.0, "url": "https://blog.golemproject.net/brass-golem-alpha2-0-14-0-182db913ed3e", "author": "rammsteinPL"}, "87kwo3": {"subreddit": "r/ethtrader", "id": "87kwo3", "text": "", "permalink": "/r/ethtrader/comments/87kwo3/3_reasons_why_africa_will_lead_the_crypto/", "title": "3 Reasons Why Africa will lead the Crypto Revolution by ACX Network's CEO", "created_utc": 1522175886.0, "url": "https://medium.com/acxnetwork/africa-first-7fdcd33bba1c", "author": "vic_turner"}, "87m38u": {"subreddit": "r/ethereum", "id": "87m38u", "text": "", "permalink": "/r/ethereum/comments/87m38u/global_blockchain_forum_april_23_2018/", "title": "Global Blockchain Forum April 2-3, 2018", "created_utc": 1522184133.0, "url": "http://global-blockchain-forum.webflow.io", "author": "EvaJoshua"}, "87n4ci": {"subreddit": "r/ethereum", "id": "87n4ci", "text": "I've been pool mining since December (I'm late to the game) and decided that I should do standard pool mining at first to learn how everything works and to ensure that everything was working correctly. Now that I'm behind this extreme beginner phase I want to branch out and try more mining options to try and maximize my returns, which bring me to a question.\n\nIf I don't need my eth right away, would it be better to switch from standard mining pool to a predicted mining pool like what https://ethpool.org/ offers. Currently I'm getting just above whattomine shows on my single mining rig (I plan on making another one). Would I benefit from switching to the predictable solo mining pool? From the looks of it, it appears that I should get a block every 2 months or so, but I'm pretty sure that I'm wrong and did the math wrong. \n\nAny help explaining how this works would be greatly appreciated.  ", "permalink": "/r/ethereum/comments/87n4ci/standard_pool_vs_predictable_solor_pool/", "title": "Standard Pool vs Predictable Solor Pool", "created_utc": 1522192522.0, "url": "https://www.reddit.com/r/ethereum/comments/87n4ci/standard_pool_vs_predictable_solor_pool/", "author": "cyphergaiden"}, "87mntq": {"subreddit": "r/ethereum", "id": "87mntq", "text": "", "permalink": "/r/ethereum/comments/87mntq/coinbase_will_support_the_ethereum_erc20/", "title": "Coinbase will support the Ethereum ERC20 technical standard", "created_utc": 1522188636.0, "url": "https://en.decentral.news/2018/03/27/coinbase-will-support-ethereum-erc20-technical-standard/", "author": "DecentralEN"}, "87fm0m": {"subreddit": "r/ethtrader", "id": "87fm0m", "text": "", "permalink": "/r/ethtrader/comments/87fm0m/i_guess_someones_satisfied_at_least/", "title": "I guess someone's satisfied at least", "created_utc": 1522124533.0, "url": "https://i.redd.it/7wm4cjj2g8o01.png", "author": "JemaKn1ght"}, "87kw2o": {"subreddit": "r/ethtrader", "id": "87kw2o", "text": "", "permalink": "/r/ethtrader/comments/87kw2o/creative_industries_on_the_blockchain_zach_lebeau/", "title": "Creative Industries on the Blockchain - Zach LeBeau of SingularDTV", "created_utc": 1522175755.0, "url": "https://dzone.com/articles/sxsw-part-1-blockchain-and-spacetech", "author": "Mikel27a"}, "87gk5f": {"subreddit": "r/ethereum", "id": "87gk5f", "text": "", "permalink": "/r/ethereum/comments/87gk5f/coinbase_announce_they_will_be_adding_support_for/", "title": "Coinbase announce they will be adding support for Ethereum ERC20 tokens", "created_utc": 1522136250.0, "url": "https://www.bitguru.co.uk/coinbase-adds-erc20-support/", "author": "jrs0080"}, "87lohh": {"subreddit": "r/ethtrader", "id": "87lohh", "text": "", "permalink": "/r/ethtrader/comments/87lohh/advisor_interview_jonathan_gillon_founder_of/", "title": "Advisor Interview: Jonathan Gillon Founder of Roost and Blockchain Expert", "created_utc": 1522181274.0, "url": "https://medium.com/@STOWITTOKEN/advisor-interview-jonathan-gillon-founder-of-roost-and-blockchain-expert-78ca29594471", "author": "dickleRick8"}, "87o9f1": {"subreddit": "r/ethereum", "id": "87o9f1", "text": "Hello all,\n\nWe just launched the subreddit r/venturecorp which is dedicated to the development of a publicly funded, owned, and operated public corporation that sells SEC compliant tokens as stock. If you are interested in contributing to the development or just want to learn more check out the subreddit. LOVE IT? We are currently accepting applications for contributing members!\n", "permalink": "/r/ethereum/comments/87o9f1/lets_use_sec_compliant_eth_tokens_to_start_a/", "title": "Let's use SEC compliant ETH tokens to start a public crowd-owned company!", "created_utc": 1522202713.0, "url": "https://www.reddit.com/r/ethereum/comments/87o9f1/lets_use_sec_compliant_eth_tokens_to_start_a/", "author": "lwadz88"}, "87gl0w": {"subreddit": "r/ethtrader", "id": "87gl0w", "text": "", "permalink": "/r/ethtrader/comments/87gl0w/capgemini_biggest_itconsulting_company_europe_is/", "title": "Capgemini, biggest IT-consulting company europe is bullish on smart contracts - had detailed talks with ChainLink and others", "created_utc": 1522136585.0, "url": "https://www.capgemini.com/consulting-de/wp-content/uploads/sites/32/2017/08/smart_contracts_paper_long_0.pdf", "author": "Trizeropz"}, "87ouwd": {"subreddit": "r/ethtrader", "id": "87ouwd", "text": "", "permalink": "/r/ethtrader/comments/87ouwd/why_did_ethereum_drop_so_hard_bitcoin_is/", "title": "Why did Ethereum Drop so hard? Bitcoin is Correcting, and Cryptocurrency Markets Follow.", "created_utc": 1522208535.0, "url": "https://hackernoon.com/why-is-ethereum-dropping-bitcoin-is-correcting-and-cryptocurrency-markets-follow-298f7e2c8c3b", "author": "rn126"}, "87lc42": {"subreddit": "r/ethtrader", "id": "87lc42", "text": "", "permalink": "/r/ethtrader/comments/87lc42/applies_to_eth_as_well/", "title": "Applies to ETH as well ...", "created_utc": 1522178904.0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/87j1i4/clearly_bitcoin_is_dead/", "author": "yeahnoworriesmate"}, "87g9ss": {"subreddit": "r/ethereum", "id": "87g9ss", "text": "Question: Does the availability of the atomic swap mean that BTC can be tokenised (i.e. wrapped) inside a ERC20 token?", "permalink": "/r/ethereum/comments/87g9ss/tokenizing_bitcoin/", "title": "Tokenizing bitcoin", "created_utc": 1522132511.0, "url": "https://www.reddit.com/r/ethereum/comments/87g9ss/tokenizing_bitcoin/", "author": "tsunamiboy6776"}, "87oy5i": {"subreddit": "r/ethtrader", "id": "87oy5i", "text": "I’ve seen a lot of wishful thinking on this board. And a lot of chest pumping and loud slogans. \n\nWe should really use our deductive faculty to figure out the root cause of this prolonged, across-the-board decline.\n\nThere are several possibilities. (Weak hands giving up isn’t one of them. EOS isn’t to blame, either.) Price suppression by the cabals is one possibility. Price manipulation by big money (in order to get in on the cheap) is another, though less likely. A third possibility is that the whales are slowly liquidating because the bubble is finally deflating. There are several reasonable possibilities.\n\nNow for each likely cause, we can come up with its ramifications and telltale signs and check if they are indeed present. This way we can zoom in on the true cause(s) of this decline and act accordingly.", "permalink": "/r/ethtrader/comments/87oy5i/scientifically_finding_the_cause_of_this/", "title": "Scientifically finding the cause of this prolonged decline", "created_utc": 1522209508.0, "url": "https://www.reddit.com/r/ethtrader/comments/87oy5i/scientifically_finding_the_cause_of_this/", "author": "mycnyc"}, "87mwsx": {"subreddit": "r/ethtrader", "id": "87mwsx", "text": "\nGemini Account Debited 132 ETH for no reason (self.Gemini)\n\nsubmitted just now by StraightLolin\n\nMy Gemini account was debited a negative of 44 ETH for no reason today 3 times putting my account balance at a -132 ETH i have contacted Gemini support to find out why but have no answer yet, has anyone else have anything similar happen to them? I am going to contact my lawyer as i feel i am being robbed by this exchange does anyone know what else i need to do in order to handle this situation.\n\nI had 20 ETH on there that i had been buying with my money which is now gone and my USD fund on the exchange are now locked from withdrawl as well i have attached a picture below \n\n\nhttps://imgur.com/a/FPMvA", "permalink": "/r/ethtrader/comments/87mwsx/gemini_account_debited_132_eth_for_no_reason/", "title": "Gemini Account Debited 132 ETH for no reason", "created_utc": 1522190768.0, "url": "https://www.reddit.com/r/ethtrader/comments/87mwsx/gemini_account_debited_132_eth_for_no_reason/", "author": "StraightLolin"}, "87l7zq": {"subreddit": "r/ethereum", "id": "87l7zq", "text": "", "permalink": "/r/ethereum/comments/87l7zq/polymath_partners_with_crowd_machine_to_boost/", "title": "Polymath Partners With Crowd Machine To Boost Adoption Of Security Tokens", "created_utc": 1522178125.0, "url": "https://blog.polymath.network/polymath-partners-with-crowd-machine-to-boost-adoption-of-security-tokens-82eb100e7c08", "author": "blindedbycrypto"}, "87jmsb": {"subreddit": "r/ethereum", "id": "87jmsb", "text": "", "permalink": "/r/ethereum/comments/87jmsb/uport_now_on_any_ethereum_blockchain/", "title": "uPort now on any Ethereum blockchain", "created_utc": 1522166939.0, "url": "https://medium.com/uport/uport-on-any-ethereum-blockchain-c54368a12e8c", "author": "pelle"}, "87fry3": {"subreddit": "r/ethtrader", "id": "87fry3", "text": "", "permalink": "/r/ethtrader/comments/87fry3/will_eth_support_at_0_hold_the_buy_wall_is_decent/", "title": "Will ETH support at 0$ hold, the buy wall is decent size?", "created_utc": 1522126443.0, "url": "https://imgur.com/a/tzNBp", "author": "Raunz"}, "87jfge": {"subreddit": "r/ethtrader", "id": "87jfge", "text": "With the recent Coinbase announcement, we've been put into an interesting spot as a mixture of ethereum supporters, token supporters, and perhaps even just general crypto enthusiasts. Maybe hodlers? I digress. \n\nWhat is an ERC20 token? Well, yes it's a token based on Ethereum, but how is it different than say... ERC721? What does non-fungible mean? These are questions you should research yourself, because if you don't know the answer you may not understand why Coinbase is supporting them, why it might not be supporting other token standards, and how that affects the general marketplace. \n\nMy participation thus far is quite limited, but in the beginning of this year I made a decision to look into more tokens than Ethereum on the simple basis that there is more value to be gained from these projects, as ETH has been grown on speculation, and while it may yet grow to a factor of 10, or even 100 fold (unlikely), it is nearly impossible to grow 1000 fold, and I **know** that intrigues some people here (even if you tell me otherwise). \n\nWith that said, I thought about a few strategies. They're hodler strategies, because we all know how trading goes for most of us (not to mention the benefits for LTCG with holding). \n\nYou could go out and buy 20 of the top ERC-20 tokens based on market cap. I get it, it might make sense, but it kind of misses the target. What are you basing the current value on? What are you basing the future value on? These are important questions, and know that you aren't the only one asking them (if you're worried, other people might be too! The reverse is also true). \n\nMy strategy? Pick 3. Something like 60-25-15 and forget about them. It's extremely high risk, and it's quite possible I'll lose all my money (so this isn't investment advice - just hodler stuff). \n\nCome May 1st, I'm expecting a market to slowly transition to a long term stagnation / eventual bull market, and the coins being added to Coinbase are likely to see some interesting gains (depending on how low their existing market cap is). \n\nIf you need to know how to get these coins, I can't really recommend anything, but Kyber.network launched recently and shapeshift.io has been around for a while (but it has expensive fees). Both are currently deemed safe, but I recommend to hold your own private keys and be careful who has authenticated your account (in case of compromise). \n\nWhich tokens specifically? Well, my idea was to stay out of the top 10, thinking about what tokens I could see being in the top 10 and actually holding that position. I look at real value. \n\nMy thoughts? \n\nA few reasonable picks: \n\nOMG, BAT, 0x, GNT, \n\nA few higher risk picks: \n\nRDN, KNT, FUN \n\n\nIt's not investor advice, be smart.", "permalink": "/r/ethtrader/comments/87jfge/in_honor_of_terrible_token_tuesdays_im_providing/", "title": "In honor of Terrible Token Tuesdays, I'm providing my two cents on contributing and growing value in the existing ERC20 token market", "created_utc": 1522165452.0, "url": "https://www.reddit.com/r/ethtrader/comments/87jfge/in_honor_of_terrible_token_tuesdays_im_providing/", "author": "jdero"}, "87kn0n": {"subreddit": "r/ethereum", "id": "87kn0n", "text": "", "permalink": "/r/ethereum/comments/87kn0n/breaking_news_ethlend_03_kogia_testnet_launch/", "title": "Breaking News: ETHLend 0.3 Kogia Testnet Launch Announced — User Experience in Focus", "created_utc": 1522173985.0, "url": "https://blog.ethlend.io/breaking-news-ethlend-0-3-kogia-testnet-launch-announced-user-experience-in-focus-db01231354f", "author": "EthWarrior"}, "87fiik": {"subreddit": "r/ethereum", "id": "87fiik", "text": "", "permalink": "/r/ethereum/comments/87fiik/griddeth_place_pixels_on_a_public_grid_for_just/", "title": "Griddeth: Place pixels on a public grid for just gas, inspired by r/place", "created_utc": 1522123495.0, "url": "http://griddeth.com/", "author": "WontonSnoop"}, "87hq1y": {"subreddit": "r/ethereum", "id": "87hq1y", "text": "", "permalink": "/r/ethereum/comments/87hq1y/the_phenomenon_of_smart_contract_honeypots/", "title": "The phenomenon of smart contract honeypots", "created_utc": 1522151006.0, "url": "https://medium.com/@gerhard.wagner/the-phenomena-of-smart-contract-honeypots-755c1f943f7b", "author": "fagnerbrack"}, "87hnln": {"subreddit": "r/ethtrader", "id": "87hnln", "text": "", "permalink": "/r/ethtrader/comments/87hnln/mark_the_jester_from_leicester_selby_about/", "title": "Mark ‘The Jester From Leicester’ Selby about Restart Energy", "created_utc": 1522150247.0, "url": "https://www.youtube.com/watch?v=Wi_ZD2g3gi4&feature=youtu.be", "author": "mme102"}, "87e80r": {"subreddit": "r/ethtrader", "id": "87e80r", "text": "", "permalink": "/r/ethtrader/comments/87e80r/increased_github_scrutiny_means_lazy_ico/", "title": "Increased Github Scrutiny Means Lazy ICO Developers Have No Place to Hide", "created_utc": 1522111119.0, "url": "https://news.bitcoin.com/increased-github-scrutiny-means-lazy-ico-developers-have-no-place-to-hide/", "author": "BobsBurgers3Bitcoin"}, "87m5qs": {"subreddit": "r/ethereum", "id": "87m5qs", "text": "Just got my early access link", "permalink": "/r/ethereum/comments/87m5qs/you_can_now_trade_ethereum_bitcoin_on_robinhood/", "title": "You can now trade Ethereum & Bitcoin on Robinhood!", "created_utc": 1522184638.0, "url": "https://www.reddit.com/r/ethereum/comments/87m5qs/you_can_now_trade_ethereum_bitcoin_on_robinhood/", "author": "Estrada123"}, "87ncss": {"subreddit": "r/ethereum", "id": "87ncss", "text": "Hey guys!\n\nI'm building a chat bot app on Toshi messenger. I have the bot running off my laptop but cannot find the user on the toshi mobile app. I was able to do this before but I don't know what I'm doing wrong. Where is the best place to post this for some help? Thank you!", "permalink": "/r/ethereum/comments/87ncss/help_on_toshi/", "title": "Help on Toshi", "created_utc": 1522194568.0, "url": "https://www.reddit.com/r/ethereum/comments/87ncss/help_on_toshi/", "author": "syndromez"}, "87nfjh": {"subreddit": "r/ethtrader", "id": "87nfjh", "text": "", "permalink": "/r/ethtrader/comments/87nfjh/enjin_funfair_bat_omg_look_solid_for_coinbase_11/", "title": "👌Enjin + FunFair + BAT + OMG Look Solid For Coinbase / 11 Year Old Having An ICO / More Crypto News", "created_utc": 1522195231.0, "url": "https://steemit.com/crypto-news/@crypt0/enjin-funfair-bat-omg-look-solid-for-coinbase-11-year-old-having-an-ico-more-crypto-news", "author": "DarkestChaos"}, "87gv7w": {"subreddit": "r/ethtrader", "id": "87gv7w", "text": "Been out of crypto for a couple of days. ETH is performing so much worse than BTC or other Alts. Whats the general theory atm?", "permalink": "/r/ethtrader/comments/87gv7w/why_is_eth_trading_behind_btc/", "title": "Why is ETH trading behind BTC?", "created_utc": 1522140513.0, "url": "https://www.reddit.com/r/ethtrader/comments/87gv7w/why_is_eth_trading_behind_btc/", "author": "Esoxxie"}, "87j11l": {"subreddit": "r/ethereum", "id": "87j11l", "text": "", "permalink": "/r/ethereum/comments/87j11l/advisor_interview_jonathan_gillon_founder_of/", "title": "Advisor Interview: Jonathan Gillon Founder of Roost and Blockchain Expert", "created_utc": 1522162363.0, "url": "https://medium.com/@STOWITTOKEN/advisor-interview-jonathan-gillon-founder-of-roost-and-blockchain-expert-78ca29594471", "author": "dickleRick8"}, "87lq10": {"subreddit": "r/ethereum", "id": "87lq10", "text": "Respectively [search](https://etherscan.io/swarm) and [upload](https://etherscan.io/swarmupload).\n\nDon't know how long they've been there. \n\n-----\n\nNoScript users: might need to [temp-]enable `googletagmanager.com`, otherwise results won't show.\n", "permalink": "/r/ethereum/comments/87lq10/today_i_noticed_etherscan_has_swarm_searchupload/", "title": "Today I Noticed: EtherScan has Swarm search/upload tools", "created_utc": 1522181569.0, "url": "https://www.reddit.com/r/ethereum/comments/87lq10/today_i_noticed_etherscan_has_swarm_searchupload/", "author": "veoxxoev"}, "87j1by": {"subreddit": "r/ethereum", "id": "87j1by", "text": "Just installed Coinbase Commerce to start accepting Ether in my shop and I can't believe how easy it is. Really hope to promote ether payments in the future!", "permalink": "/r/ethereum/comments/87j1by/coinbase_is_killing_it_right_now/", "title": "Coinbase is killing it right now!", "created_utc": 1522162432.0, "url": "https://www.reddit.com/r/ethereum/comments/87j1by/coinbase_is_killing_it_right_now/", "author": "WoodlandShades"}, "87hc2k": {"subreddit": "r/ethereum", "id": "87hc2k", "text": "", "permalink": "/r/ethereum/comments/87hc2k/the_state_of_ethereum_scaling_march_2018/", "title": "The State of Ethereum Scaling, March 2018: Highlights from EthCC on Plasma Cash, Minimum Viable Plasma, and More…", "created_utc": 1522146549.0, "url": "https://medium.com/loom-network/the-state-of-ethereum-scaling-march-2018-74ac08198a36", "author": "jamesmduffy"}, "87h5bo": {"subreddit": "r/ethtrader", "id": "87h5bo", "text": "Now in the dregs of a months-long bear market, the negatives have come out in force and frequently suggest an investment in Ethereum is somehow a reckless gamble.  That word is often used here like a weapon.\n\nIt's not used in the colloqueal sense, like taking a risk (and to be clear, everyone should know an investment in crypto carries risk), they mean an investment in the space is the literal equivalent of putting your money on the craps table and hoping for the best.\n\nWith that sort of dice game, you're paying for a cheap trick, entertainment.  The *illusion* that you can make large amounts of money quickly and easily for little outlay.  It's like a magic show, a short thrill that's gone almost before it began, which leaves you with nothing tangible save a lighter wallet.\n\nEth and blockchains are transformative technologies, not games, not illusions.  You don't see serious financial outlets discussing the horses, but you do see them speaking ever more frequently about eth.  Fortune 100 (let alone Fortune 500) companies are taking a serious interest.\n\nAll signs point to Ethereum revolutionizing traditional markets and finance *at worst*.  At best, Ethereum and similar technologies will underpin the foundation of our digital infrastructure, reshaping the way we interact in fundamental ways.\n\nAnd none of that has changed between January and now.  Markets undulate, they do.  And sometimes it's painful.  The only surprising aspect is the quick pivot to absurdly bearish sentiment based on little of genuine substance.\n\nIf you want an investment, Ethereum is your play.\n\nIf you want to gamble, short it.  Go ahead.", "permalink": "/r/ethtrader/comments/87h5bo/lets_define_gambling/", "title": "Lets Define “Gambling”", "created_utc": 1522144283.0, "url": "https://www.reddit.com/r/ethtrader/comments/87h5bo/lets_define_gambling/", "author": "Joseph_Peach"}, "87iic2": {"subreddit": "r/ethtrader", "id": "87iic2", "text": "", "permalink": "/r/ethtrader/comments/87iic2/newsbtc_the_main_benefits_of_apod_token/", "title": "NewsBTC : The Main Benefits of APOD Token", "created_utc": 1522158212.0, "url": "https://www.newsbtc.com/2018/03/26/main-benefits-apod-token/#", "author": "CryptoKool"}, "87oy6v": {"subreddit": "r/ethtrader", "id": "87oy6v", "text": "", "permalink": "/r/ethtrader/comments/87oy6v/the_good_old_dayswill_we_return/", "title": "The good old days....Will we return ?", "created_utc": 1522209519.0, "url": "https://imgur.com/a/9d2Mc", "author": "MrClownberg"}, "87j7te": {"subreddit": "r/ethereum", "id": "87j7te", "text": "There are 3 conferences in New York and they are all in the week of May 12. Wondering if anyone here has decided which conference to attend and why? \n\nI'm leaning towards ConsesnSys and Token Summit but the ConsenSys one is really expensive ($2K) so I might skip it and just attend Token Summit.", "permalink": "/r/ethereum/comments/87j7te/which_of_the_ethereum_conferences_in_new_york_are/", "title": "Which of the Ethereum conferences in New York are you attending? Ethereal, ConsenSys, Token Summit", "created_utc": 1522163849.0, "url": "https://www.reddit.com/r/ethereum/comments/87j7te/which_of_the_ethereum_conferences_in_new_york_are/", "author": "bijansha"}, "87lc2d": {"subreddit": "r/ethereum", "id": "87lc2d", "text": "I mean there will be status.im but normally apps, platforms, etc. come for desktop and mobile togheder. How come Metamask in more than one year has not been adapted for mobile version? ", "permalink": "/r/ethereum/comments/87lc2d/why_there_is_not_metamask_for_mobile/", "title": "Why there is not Metamask for mobile?", "created_utc": 1522178894.0, "url": "https://www.reddit.com/r/ethereum/comments/87lc2d/why_there_is_not_metamask_for_mobile/", "author": "Faghe"}, "87hh3d": {"subreddit": "r/ethtrader", "id": "87hh3d", "text": "", "permalink": "/r/ethtrader/comments/87hh3d/how_shivom_is_creating_the_largest_genomic/", "title": "How Shivom is creating the largest genomic data-hub on the planet", "created_utc": 1522148174.0, "url": "https://www.techbullion.com/how-shivom-is-creating-the-largest-genomic-data-hub-on-the-planet/", "author": "mme102"}, "87onvn": {"subreddit": "r/ethereum", "id": "87onvn", "text": "Running W10, fully updated, latest stable version of the wallet. It's never worked well. Every time I use it there's a battle in getting it connected. I have to manually run geth.exe, press enter a few times, hope it starts downloading the blocks. After a bunch of manual intervention, I can get it synced. I'm tired of it. Fuck supporting it when I can't trust the wallet to sync. Does anyone experience the same issues? ", "permalink": "/r/ethereum/comments/87onvn/eth_wallet_is_too_problematic_thinking_of/", "title": "ETH wallet is too problematic, thinking of dropping ETH altogether.", "created_utc": 1522206539.0, "url": "https://www.reddit.com/r/ethereum/comments/87onvn/eth_wallet_is_too_problematic_thinking_of/", "author": "GSODT"}, "87opo4": {"subreddit": "r/ethereum", "id": "87opo4", "text": "", "permalink": "/r/ethereum/comments/87opo4/stateless_payments_for_stateless_people_an/", "title": "Stateless payments for stateless people (an article from OmiseGO founder)", "created_utc": 1522207036.0, "url": "https://blog.omisego.network/stateless-payments-for-stateless-people-55a4fc323c4e?source=linkShare-c6d425ee105f-1522206792", "author": "erdal_mutlu"}, "87igd0": {"subreddit": "r/ethtrader", "id": "87igd0", "text": "", "permalink": "/r/ethtrader/comments/87igd0/can_blockchain_save_us_from_fake_news/", "title": "Can Blockchain Save Us From Fake News?", "created_utc": 1522157712.0, "url": "https://www.investinblockchain.com/fake-news-blockchain-solution/", "author": "coinr"}, "87ejjx": {"subreddit": "r/ethereum", "id": "87ejjx", "text": "", "permalink": "/r/ethereum/comments/87ejjx/coinbase_to_support_erc20_technical_standards_in/", "title": "Coinbase to Support ERC20 Technical Standards “In the Coming Months”", "created_utc": 1522113984.0, "url": "https://bitcoinmagazine.com/articles/coinbase-support-erc20-technical-standards-coming-months/#1522102285", "author": "deezydmv"}, "87glby": {"subreddit": "r/ethereum", "id": "87glby", "text": "", "permalink": "/r/ethereum/comments/87glby/geth_v183_released_contains_bug_and_block_dos/", "title": "Geth v1.8.3 released! Contains bug- and block DoS fixes.", "created_utc": 1522136708.0, "url": "https://github.com/ethereum/go-ethereum/releases/tag/v1.8.3", "author": "karalabe"}, "87nkrz": {"subreddit": "r/ethereum", "id": "87nkrz", "text": "", "permalink": "/r/ethereum/comments/87nkrz/update_elix_boost_video_demo_adds_support_for/", "title": "[UPDATE] ELIX Boost Video Demo, Adds Support For Ether Crowdfunding", "created_utc": 1522196459.0, "url": "https://www.reddit.com/r/altcoin/comments/87njwr/update_elix_boost_video_demo_adds_support_for/", "author": "cryptoredditr"}, "87fw8a": {"subreddit": "r/ethtrader", "id": "87fw8a", "text": "", "permalink": "/r/ethtrader/comments/87fw8a/canya_is_getting_sassy_with_the_supponoob/", "title": "CanYa is getting sassy with the SuppoNoob!", "created_utc": 1522127839.0, "url": "https://i.redd.it/tguilpuvp8o01.png", "author": "HubertEpaphroditus"}, "87fior": {"subreddit": "r/ethtrader", "id": "87fior", "text": "*If* you believe in the long-term potential of ETH, I don't get why you would be upset with the recent bear market ( or correction ). Bear markets are fantastic times to accumulate. Just buy a small amount at a time with each drop. Don't try to time the bottom--you probably be unsuccessful. Believers should be ecstatic right now, we've just washed out so many people who were just in it for some quick cash. You really don't think they'll be back once things start turning around? If you're truly a long-term believer, your objective should be to max the amount of ETH you have, and not worry about its present-day value.\n\nI guess if you think that ETH is done and going to zero then sure be upset, but otherwise rejoice! This is a gift. Remember those stupid Chappelle memes? Well, your wish has been granted, so don't waste it. \n\nAnd if you are upset because you had 100% of your fiat already invested, I'd honestly say that's your own damn fault. It's incredibly risky to be 100% invested in a single asset, much less an asset as volatile as crypto. Let this be a lesson to you. Chances are you are young and you'll have your whole life ahead of you to invest, so learn something from your mistakes and don't repeat them. Especially given how bullish the world economy has been, I think you'd be unwise to not have some proportion of your investments in either cash or a very safe asset right now.\n\nAlways remember the sage advise of Warren Buffet:\n\"Be fearful when others are greedy and greedy when others are fearful\"\n\nDude's the 3rd richest man on earth. Chances are he knows what he's talking about.", "permalink": "/r/ethtrader/comments/87fior/why_are_believers_upset_with_the_recent_price/", "title": "Why are believers upset with the recent price movement?", "created_utc": 1522123546.0, "url": "https://www.reddit.com/r/ethtrader/comments/87fior/why_are_believers_upset_with_the_recent_price/", "author": "freshLikeGD"}, "87ogbu": {"subreddit": "r/ethereum", "id": "87ogbu", "text": "", "permalink": "/r/ethereum/comments/87ogbu/ethereum_falls_after_rumors_of_a_powerful_mining/", "title": "Ethereum falls after rumors of a powerful mining chip surface", "created_utc": 1522204473.0, "url": "https://www.yahoo.com/finance/news/ethereum-falls-rumors-powerful-mining-184801947.html", "author": "dunkin1980"}, "87eqf6": {"subreddit": "r/ethtrader", "id": "87eqf6", "text": "", "permalink": "/r/ethtrader/comments/87eqf6/upcoming_exchangeotcminingpaymentsblockchain/", "title": "Upcoming Exchange+OTC+Mining+Payments+Blockchain Institute for the Black Sea Region EUR/USD GAS/NEO/ETH/BTC/SIB trading pairs.", "created_utc": 1522115673.0, "url": "https://bitcointalk.org/index.php?topic=3173859.0", "author": "Ronin4nana"}, "87j3le": {"subreddit": "r/ethtrader", "id": "87j3le", "text": "", "permalink": "/r/ethtrader/comments/87j3le/crypto_trading_bots/", "title": "Crypto trading bots", "created_utc": 1522162926.0, "url": "https://rados.io/crypto-trading-bots-on-decentralized-exchanges/", "author": "neuralhax0r"}, "87i5go": {"subreddit": "r/ethtrader", "id": "87i5go", "text": "Hello everyone, I’m a long time miner/trader and follower of this subreddit. Today I’d like to share an ICO founding of myself : JointVentures.io. The project is based on rewarding comments and creators of the content. I think it’s a solid project and the team behind is working good to have a decent working product. Even their commenting system is in beta phase and you can test it on your website. I’ve contributed their private sale and would like to share it with you guys before the ICO goes live. They give 25% bonus which seems pretty good opportunity. \n\nHere is the link : http://www.jointventures.io \n\nThey have also reviews on couple ICO research websites. Go check it out for yourselves :)", "permalink": "/r/ethtrader/comments/87i5go/jointventuresio_private_sale_has_started/", "title": "JointVentures.io Private Sale Has Started", "created_utc": 1522155052.0, "url": "https://www.reddit.com/r/ethtrader/comments/87i5go/jointventuresio_private_sale_has_started/", "author": "nithronium"}, "87i6kr": {"subreddit": "r/ethtrader", "id": "87i6kr", "text": "", "permalink": "/r/ethtrader/comments/87i6kr/sharering_meet_the_blockchain_startup_with_a/", "title": "ShareRing - Meet the Blockchain Startup with a Dual-Coin Setup to Combat Volatility in Crypto", "created_utc": 1522155312.0, "url": "https://bitcoingarden.org/meet-the-blockchain-startup-with-a-dual-coin-setup-to-combat-volatility-in-crypto/", "author": "gosupetey"}, "87hn7u": {"subreddit": "r/ethtrader", "id": "87hn7u", "text": "", "permalink": "/r/ethtrader/comments/87hn7u/view_historical_trends_of_any_crypto_compared_to/", "title": "View historical trends of any crypto compared to ETH", "created_utc": 1522150125.0, "url": "https://cryptocurrencyanalysis.com/?ticker1=ETC&ticker2=ETH&plottype=log", "author": "We_are_all_satoshi"}, "87ifdd": {"subreddit": "r/ethereum", "id": "87ifdd", "text": "", "permalink": "/r/ethereum/comments/87ifdd/centra_partners_with_rootproject_huge_step/", "title": "Centra partners with RootProject. Huge step towards building out infrastructure for ROOTS tokens.", "created_utc": 1522157474.0, "url": "https://medium.com/@Centra_Asia/centra-asia-partners-with-root-project-c492d306f2b4", "author": "Pamela14Vur"}, "87jcgd": {"subreddit": "r/ethtrader", "id": "87jcgd", "text": "", "permalink": "/r/ethtrader/comments/87jcgd/stk_joins_the_ethereum_enterprise_alliance/", "title": "STK joins the Ethereum Enterprise Alliance", "created_utc": 1522164808.0, "url": "https://medium.com/@STKtoken/stk-joins-the-ethereum-enterprise-alliance-7f1adbd9f9a5", "author": "Nikhil9865"}, "87ndkl": {"subreddit": "r/ethtrader", "id": "87ndkl", "text": "", "permalink": "/r/ethtrader/comments/87ndkl/rightmesh_shows_live_µraiden_payment_channel/", "title": "RightMesh shows live µRaiden payment channel updates on the RightMesh wallet between two distinct mobile mesh networks", "created_utc": 1522194757.0, "url": "https://medium.com/rightmesh/as-we-promised-in-the-rightmesh-project-roadmap-here-is-a-demonstration-of-the-rmesh-tokens-being-8bb01bc9e538", "author": "BreezyZebra"}, "87hgtb": {"subreddit": "r/ethereum", "id": "87hgtb", "text": "", "permalink": "/r/ethereum/comments/87hgtb/sparkster_launching_ethereum_smart_contracts/", "title": "Sparkster launching Ethereum smart contracts", "created_utc": 1522148081.0, "url": "https://twitter.com/Sparkster_Me/status/978570883295047680", "author": "Jjstewardson"}, "87nygy": {"subreddit": "r/ethereum", "id": "87nygy", "text": "", "permalink": "/r/ethereum/comments/87nygy/ethbuenosaires_announced_major_ethereum_hackathon/", "title": "ETHBuenosAires announced! Major Ethereum hackathon after Waterloo and Denver and largest outside North America! May 25th - 28th. Applications open now", "created_utc": 1522199941.0, "url": "http://ethbuenosaires.com/", "author": "lihorne"}, "87el58": {"subreddit": "r/ethtrader", "id": "87el58", "text": "", "permalink": "/r/ethtrader/comments/87el58/elix_mobile_crowdfunding_application_adds_eth_as/", "title": "ELIX mobile crowdfunding application adds ETH as an accepted currency", "created_utc": 1522114375.0, "url": "https://medium.com/@elixirtoken/support-for-ether-crowdfunding-boost-video-demo-and-creator-portal-55cdeb86adaf", "author": "Polkadottedzan"}, "87juxd": {"subreddit": "r/ethereum", "id": "87juxd", "text": "", "permalink": "/r/ethereum/comments/87juxd/governance_in_0x_protocol/", "title": "Governance in 0x Protocol", "created_utc": 1522168514.0, "url": "https://blog.0xproject.com/governance-in-0x-protocol-86779ae5809e", "author": "willwarren89"}, "87kud4": {"subreddit": "r/ethereum", "id": "87kud4", "text": "", "permalink": "/r/ethereum/comments/87kud4/kauri_the_knowledge_network_for_the_ethereum/", "title": "Kauri: The Knowledge Network for the Ethereum Ecosystem", "created_utc": 1522175403.0, "url": "https://media.consensys.net/kauri-the-knowledge-network-for-the-ethereum-ecosystem-bccc80c0f3ab", "author": "jdbender66"}, "87nols": {"subreddit": "r/ethereum", "id": "87nols", "text": "If bitmains asics turn out to be ~200 MH/s, equivalent to 6-8 GPU rig, that wont be a problem for anyone else other than miners whose profits are going to drop even lower. But what if it turns out it has hashrate in order of GH? \n\n1. How strong would they have to be for devs to stop working on PoS and start making changes to kick asics off?\n\n2. How long would it take to potentially implement such changes?\n", "permalink": "/r/ethereum/comments/87nols/how_strong_would_an_eth_asic_have_to_be_for_devs/", "title": "How strong would an ETH asic have to be for devs to consider \"poisoning the well\" / implementing changes to the network that would kick them out?", "created_utc": 1522197414.0, "url": "https://www.reddit.com/r/ethereum/comments/87nols/how_strong_would_an_eth_asic_have_to_be_for_devs/", "author": "sovuljaner"}, "87kw3c": {"subreddit": "r/ethereum", "id": "87kw3c", "text": "", "permalink": "/r/ethereum/comments/87kw3c/creative_industries_on_the_blockchain_zach_lebeau/", "title": "Creative Industries on the Blockchain - Zach LeBeau of SingularDTV", "created_utc": 1522175760.0, "url": "https://dzone.com/articles/sxsw-part-1-blockchain-and-spacetech", "author": "Mikel27a"}, "87kg2i": {"subreddit": "r/ethereum", "id": "87kg2i", "text": "There seems to be very few resources on how a bridge actually works on a technical level. Can anyone provide an explanation or share some resources on the topic?", "permalink": "/r/ethereum/comments/87kg2i/how_does_a_crosschain_bridge_work/", "title": "How does a cross-chain bridge work?", "created_utc": 1522172638.0, "url": "https://www.reddit.com/r/ethereum/comments/87kg2i/how_does_a_crosschain_bridge_work/", "author": "account4184"}, "87g0sp": {"subreddit": "r/ethereum", "id": "87g0sp", "text": "", "permalink": "/r/ethereum/comments/87g0sp/eligma_and_microsoft_team_up_on_ai_development/", "title": "Eligma and Microsoft team up on AI development", "created_utc": 1522129429.0, "url": "https://www.youtube.com/watch?v=D-KH_o5-EBU", "author": "Rukewetony"}, "87f8qc": {"subreddit": "r/ethereum", "id": "87f8qc", "text": "", "permalink": "/r/ethereum/comments/87f8qc/was_just_scammed_by_this_beware/", "title": "Was just scammed by this beware", "created_utc": 1522120631.0, "url": "https://i.redd.it/x65072tl48o01.png", "author": "Whitenoise67"}, "87lbhs": {"subreddit": "r/ethtrader", "id": "87lbhs", "text": "", "permalink": "/r/ethtrader/comments/87lbhs/education_ecosystem_is_partnering_with_blockshow/", "title": "Education Ecosystem is partnering with BlockShow for BlockShow Europe 2018 in Berlin, Germany on May 28-29.", "created_utc": 1522178786.0, "url": "https://medium.com/edu-coins/liveedu-roadshow-events-meetups-liveedu-ico-will-be-presenting-at-dd94cf4a8c3c", "author": "EvaJoshua"}, "87oy0q": {"subreddit": "r/ethtrader", "id": "87oy0q", "text": "", "permalink": "/r/ethtrader/comments/87oy0q/ethereum_falls_after_rumors_of_a_powerful_mining/", "title": "Ethereum falls after rumors of a powerful mining chip surface", "created_utc": 1522209465.0, "url": "https://techcrunch.com/2018/03/27/ethereum-has-the-asic-blues/?utm_source=quora", "author": "Likely_as_Not"}, "87ip8x": {"subreddit": "r/ethtrader", "id": "87ip8x", "text": "", "permalink": "/r/ethtrader/comments/87ip8x/6000_south_korean_outlets_to_make/", "title": "6,000 South Korean Outlets to Make Cryptocurrencies Available by Q2 2018", "created_utc": 1522159821.0, "url": "https://www.ccn.com/6000-south-korean-outlets-to-make-cryptocurrencies-available-by-q2-2018/", "author": "-Sledgehammer-"}, "87ks69": {"subreddit": "r/ethereum", "id": "87ks69", "text": "", "permalink": "/r/ethereum/comments/87ks69/a_hitchhikers_guide_to_distributed_systems_by/", "title": "A Hitchhiker’s Guide to Distributed Systems - by Storj", "created_utc": 1522174980.0, "url": "https://blog.storj.io/post/172275100478/a-hitchhikers-guide-to-distributed-systems", "author": "cryptobubble"}, "87elyi": {"subreddit": "r/ethereum", "id": "87elyi", "text": "", "permalink": "/r/ethereum/comments/87elyi/why_is_this_topic_locked/", "title": "Why is this topic locked?", "created_utc": 1522114577.0, "url": "https://www.reddit.com/r/ethereum/comments/87c98x/ethereums_bad_month_why_it_happened_and_why_we/?st=jf8zo9e6&sh=127e8839", "author": "Ronin4nana"}, "87dk6u": {"subreddit": "r/ethereum", "id": "87dk6u", "text": "", "permalink": "/r/ethereum/comments/87dk6u/coinbase_open_doors_to_erc20_tokens_ccg/", "title": "Coinbase Open Doors to ERC20 Tokens | CCG", "created_utc": 1522105271.0, "url": "https://www.cryptocurrencyguide.org/coinbase-open-doors-to-erc20-tokens/", "author": "BrunoCerqueira"}, "87emng": {"subreddit": "r/ethtrader", "id": "87emng", "text": "", "permalink": "/r/ethtrader/comments/87emng/bitmain_has_developed_an_ethereum_asic_miner_wall/", "title": "Bitmain Has Developed an Ethereum ASIC Miner, Wall Street Analyst Claims", "created_utc": 1522114755.0, "url": "https://finance.yahoo.com/news/bitmain-developed-ethereum-asic-miner-194845158.html", "author": "twigwam"}, "87jt8n": {"subreddit": "r/ethtrader", "id": "87jt8n", "text": "", "permalink": "/r/ethtrader/comments/87jt8n/uport_on_any_ethereum_blockchain_why_uport/", "title": "uPort on any Ethereum blockchain: Why uPort Supports Multiple Networks & Application Accounts", "created_utc": 1522168180.0, "url": "https://medium.com/uport/uport-on-any-ethereum-blockchain-c54368a12e8c", "author": "jdbender66"}, "87g5ku": {"subreddit": "r/ethtrader", "id": "87g5ku", "text": "Welcome to the Daily Altcoin Discussion thread of /r/EthTrader. \n\n***\n\nThe thread guidelines are as follows:\n\n-  All sub rules apply here so please review our **[rules page](https://www.reddit.com/r/ethtrader/about/rules/)** to become familiar with them. The rules page is also linked in the announcement bar above.\n-  This thread is intended as a welcome place for discussion of all non-Ethereum related crypto.\n\n***\n\n Resources and other information:\n\n* Newcomers who have basic questions about Ethereum can find answers by visiting /r/EthereumNoobies or our Ethereum Education wiki page, [see here](https://www.reddit.com/r/ethtrader/wiki/education).\n\n* To view live streaming comments for this thread, [click here](https://reddit-stream.com/comments/auto).  Account permissions are required to post comments through Reddit-Stream.com.\n\n***\n\nEnjoy!\n", "permalink": "/r/ethtrader/comments/87g5ku/daily_altcoin_discussion_march_27_2018/", "title": "Daily Altcoin Discussion - March 27, 2018", "created_utc": 1522131072.0, "url": "https://www.reddit.com/r/ethtrader/comments/87g5ku/daily_altcoin_discussion_march_27_2018/", "author": "AutoModerator"}, "87f2g3": {"subreddit": "r/ethtrader", "id": "87f2g3", "text": "I would like to know if it's possible to check the ratio between ETH/BTC and alts.\n\nMaybe I can get the same amount of ETH I spent because the ratio is similar.\n\nSorry for my bad english and no explanation. I have an idea in my head but I can't seem to put it into words in english.\n\nExample: I bought 1 BNTY for 1 ETH when BNTY was $10 and ETH was $100. But now that 1 BNTY is $1 and 1 ETH is $10, the ratio is still the same and the amount of ETH I will get will be the same.\n\nDon't know if it makes any sense, in my head it does.", "permalink": "/r/ethtrader/comments/87f2g3/where_can_i_check_if_the_ratio_between_ethbtcalts/", "title": "Where can I check if the ratio between ETH(BTC)/alts is the same as a few months ago now that price has dipped a lot?", "created_utc": 1522118893.0, "url": "https://www.reddit.com/r/ethtrader/comments/87f2g3/where_can_i_check_if_the_ratio_between_ethbtcalts/", "author": "furyasd"}, "87jyhq": {"subreddit": "r/ethtrader", "id": "87jyhq", "text": "", "permalink": "/r/ethtrader/comments/87jyhq/you_are_here_the_bottom_of_the_gartner_hype_cycle/", "title": "YOU ARE HERE: The bottom of the Gartner Hype Cycle. HODL", "created_utc": 1522169307.0, "url": "https://cdn.vox-cdn.com/thumbor/sepDx229nJYvj38DXf1O3H3SHgc=/1200x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/10531315/Emerging_Technology_Hype_Cycle_for_2017_Infographic_R6A.jpg", "author": "DropGun"}, "87ndso": {"subreddit": "r/ethereum", "id": "87ndso", "text": "", "permalink": "/r/ethereum/comments/87ndso/rightmesh_shows_live_µraiden_payment_channel/", "title": "RightMesh shows live µRaiden payment channel updates on the RightMesh wallet between two distinct mobile mesh networks", "created_utc": 1522194809.0, "url": "https://medium.com/rightmesh/as-we-promised-in-the-rightmesh-project-roadmap-here-is-a-demonstration-of-the-rmesh-tokens-being-8bb01bc9e538", "author": "BreezyZebra"}, "87guq9": {"subreddit": "r/ethtrader", "id": "87guq9", "text": "Like are we not moving to Casper with no need for mining? If Casper happens, what use will Eth specific asic miner have?\n\n\"During our travels through Asia last week, we confirmed that Bitmain has already developed an ASIC [application-specific integrated circuit] for mining Ethereum, and is readying the supply chain for shipments in 2Q18,\" analyst Christopher Rolland wrote in a note to clients Monday. \"While Bitmain is likely to be the largest ASIC vendor (currently 70-80% of Bitcoin mining ASICs) and the first to market with this product, we have learned of at least three other companies working on Ethereum ASICs, all at various stages of development.\"\n\nhttps://www.cnbc.com/2018/03/26/analyst-slashes-amd-nvidia-price-targets-on-new-cryptocurrency-mining-chip-from-china.html", "permalink": "/r/ethtrader/comments/87guq9/why_companies_try_to_make_eth_asic_miner/", "title": "Why companies try to make Eth ASIC miner?", "created_utc": 1522140317.0, "url": "https://www.reddit.com/r/ethtrader/comments/87guq9/why_companies_try_to_make_eth_asic_miner/", "author": "sala91"}, "87o98r": {"subreddit": "r/ethereum", "id": "87o98r", "text": "", "permalink": "/r/ethereum/comments/87o98r/europol_cracks_down_cybergang_laundered_money/", "title": "Europol Cracks Down Cybergang; Laundered Money Using Cryptos", "created_utc": 1522202662.0, "url": "https://www.btcnn.com/europol-cracks-down-cybergang-laundered-money-using-cryptos/", "author": "linzerdshaffen"}, "87lvtm": {"subreddit": "r/ethtrader", "id": "87lvtm", "text": "I sold some eth to buy a car back in January and now with the price where it is I am thinking of selling it to buy back in. Would you consider doing the same? I know no one has any idea what the price will do for sure. This feels similar to when bitcoin came down from 1200 the first time. I know in that case there were years of good buying opportunity but these days things move faster. Would you keep the car to enjoy for awhile or sell as soon as possible. The car is just a toy and not necessary if that makes any difference. The car is a 2011 local motors rally fighter. It has not lost value since buying it.", "permalink": "/r/ethtrader/comments/87lvtm/i_would_like_your_opinions/", "title": "I would like your opinions.", "created_utc": 1522182675.0, "url": "https://www.reddit.com/r/ethtrader/comments/87lvtm/i_would_like_your_opinions/", "author": "whcrawler"}, "87ejd6": {"subreddit": "r/ethereum", "id": "87ejd6", "text": "", "permalink": "/r/ethereum/comments/87ejd6/blockchain_can_eliminate_fake_news/", "title": "Blockchain Can Eliminate Fake News", "created_utc": 1522113934.0, "url": "https://the-blockchain-journal.com/2018/03/27/blockchain-can-eliminate-fake-news/", "author": "Leaders17"}, "87klkc": {"subreddit": "r/ethereum", "id": "87klkc", "text": "", "permalink": "/r/ethereum/comments/87klkc/did_bitmain_develop_an_ethereum_asic_miner/", "title": "Did Bitmain Develop an Ethereum ASIC Miner?", "created_utc": 1522173719.0, "url": "https://usethebitcoin.com/did-bitmain-develop-an-ethereum-asic-miner/", "author": "andix3"}, "87iqno": {"subreddit": "r/ethereum", "id": "87iqno", "text": "", "permalink": "/r/ethereum/comments/87iqno/ethereum_founder_tackles_fees_20_paytostay/", "title": "Ethereum Founder Tackles Fees 2.0; Pay-To-Stay Proposed", "created_utc": 1522160121.0, "url": "https://www.btcnn.com/ethereum-founder-tackles-fees-2-0-pay-to-stay-proposed/", "author": "linzerdshaffen"}, "87e6i6": {"subreddit": "r/ethereum", "id": "87e6i6", "text": "", "permalink": "/r/ethereum/comments/87e6i6/disciplina_airdrop_participate_now/", "title": "Disciplina AirDrop - Participate Now!!", "created_utc": 1522110736.0, "url": "https://i.redd.it/ww9bgfm9vrn01.png", "author": "CorradoKid"}, "87ltav": {"subreddit": "r/ethereum", "id": "87ltav", "text": "", "permalink": "/r/ethereum/comments/87ltav/erc721_full_implementation_by_spalladino_pull/", "title": "ERC721 full implementation by spalladino · Pull Request #803 · OpenZeppelin/zeppelin-solidity", "created_utc": 1522182193.0, "url": "https://github.com/OpenZeppelin/zeppelin-solidity/pull/803", "author": "dragonfrugal"}, "87lvur": {"subreddit": "r/ethereum", "id": "87lvur", "text": "", "permalink": "/r/ethereum/comments/87lvur/simple_staking_interface_ethereum_improvement/", "title": "Simple Staking Interface -- Ethereum Improvement Proposals", "created_utc": 1522182680.0, "url": "http://eips.ethereum.org/EIPS/eip-900", "author": "twigwam"}, "87e84c": {"subreddit": "r/ethereum", "id": "87e84c", "text": "", "permalink": "/r/ethereum/comments/87e84c/bitmains_new_ethereum_asic_miner_will_kill_gpu/", "title": "Bitmain's New Ethereum ASIC Miner Will Kill GPU Mining", "created_utc": 1522111141.0, "url": "https://www.youtube.com/watch?v=kt-u9q-0ySE", "author": "mrsotkogaming"}, "87fju3": {"subreddit": "r/ethereum", "id": "87fju3", "text": "I'm currently working on [Ardent United](https://www.ardentunited.com), a crowdfunded and crowdgoverned esports team. We're wondering what you want to see and prioritize in a decentralized governance system. Is it easily analyzed data, security tokens, simple voting system, etc.?\n\nDiscuss!", "permalink": "/r/ethereum/comments/87fju3/open_discussiondecentralized_governance/", "title": "Open Discussion:Decentralized Governance", "created_utc": 1522123901.0, "url": "https://www.reddit.com/r/ethereum/comments/87fju3/open_discussiondecentralized_governance/", "author": "Legionof7"}, "87fmjy": {"subreddit": "r/ethtrader", "id": "87fmjy", "text": "", "permalink": "/r/ethtrader/comments/87fmjy/a_message_from_the_founder_of_thought_mr_andrew_j/", "title": "A message from the Founder of Thought, Mr. Andrew J. Hacker", "created_utc": 1522124704.0, "url": "http://cryptofinance24.com/a-message-from-the-founder-of-thought-mr-andrew-j-hacker-p261-168.htm", "author": "Thought_THT"}, "87kf6m": {"subreddit": "r/ethtrader", "id": "87kf6m", "text": "Medichain utilize EMR data of a patient to be utilized in health ecosystem specially for insurance company, health researcher, pharmacy industries, etc. MediChain Utility Tokens (MCU) represent the value of arbitrary patient data blocks. There are benefit to be obtained by MCU token holders benefit in a number of ways: 1. Institutional Medical Data Services (including Diagnosis) 2. Medical Research Data Services 3. Any/All additional future business transactions on the MediChain Platform 4. Personal Medical Data Services, Storage and Transfer 5. MCU Discounts 6. Research Program Voting. Get the chance to determine the focus of future research Further information can be obtained at this link: https://medichain.online/", "permalink": "/r/ethtrader/comments/87kf6m/medichain_tokens_represent_health_ecosystem/", "title": "Medichain Tokens Represent Health Ecosystem Through Blockchain Technology", "created_utc": 1522172445.0, "url": "https://www.reddit.com/r/ethtrader/comments/87kf6m/medichain_tokens_represent_health_ecosystem/", "author": "denio17"}, "87o8xy": {"subreddit": "r/ethtrader", "id": "87o8xy", "text": "It is with sadness and confusion that I, Jonathon Dunford (Co-founder @ ForkDelta), present the community with some unfortunate and shocking news.\n\nOn the evening of March 26th, after about 2 weeks of very limited communication from Arseniy (Co-founder @ ForkDelta), his near absence on ForkDelta, and repeated attempts to communicate with him, I was shocked to find he suddenly revoked my access to all aspects of the ForkDelta project.\n\nWhen I asked about what was going on, he responded by saying he had \"fired\" me as Co-founder. Shocked, I asked how he came to such a rash decision, and his reasoning alluded to a token that slipped by our listing process in the early stages of ForkDelta that was later delisted.\n\nI want to make it abundantly clear that given these rash decisions that are very detrimental to the growth and health of ForkDelta, I am incredibly uncertain about its future.\n\nWith all of the hard work I and several other developers/contributors have poured into ForkDelta in the past 3 months, I have every intent to begin work on a new exchange. I have spoken with all of the devs and contributors that worked on the ForkDelta project and several of them have expressed their interest in switching to the new venture.\n\nWe are discussing some pretty revolutionary ideas that could change the DEX landscape for the better.\n\nThis is not the end. We will build something better.\n\nI will make some announcements via Twitter when we get some official repositories finalized.\n\nhttps://twitter.com/6BigBrother", "permalink": "/r/ethtrader/comments/87o8xy/important_news_regarding_forkdelta/", "title": "IMPORTANT NEWS regarding ForkDelta", "created_utc": 1522202584.0, "url": "https://www.reddit.com/r/ethtrader/comments/87o8xy/important_news_regarding_forkdelta/", "author": "6bigbrother"}, "87mmom": {"subreddit": "r/ethereum", "id": "87mmom", "text": "A key component to work along side immutable blockchain operations is a tx fee free 'best effort' replication network to facilitate building more scalable and cheaper Dapps.\n\nhttps://github.com/andrewheadricke/sigreplicator\n\nFire up a node and help grow the network.", "permalink": "/r/ethereum/comments/87mmom/passive_offchain_signed_string_storage_and/", "title": "Passive off-chain signed string storage and replication using Ethereum crypto and IPFS", "created_utc": 1522188384.0, "url": "https://www.reddit.com/r/ethereum/comments/87mmom/passive_offchain_signed_string_storage_and/", "author": "ReinoutWolter"}, "87j7rx": {"subreddit": "r/ethereum", "id": "87j7rx", "text": "Hi,\n\nPhase 1:\nwith my friends we created the first Fork of 0xBitcoin right after it released, we liked the idea that bring PoW in the ERC20 economy.\nAs our fault we made some changes in the difficulty calculation it make PoWEth mining impossible, so we had to go faster to the second phase than we expected.\n\nPhase 2, PoWAdv:\n- As much we like the PoW ERC20 token idea, we have many criticism against it to build a virtual mining economy where it has no security meaning.\nIn our solution, PoW reliable for a constant Token distribution which handled by holders and the community. \n\nOld version:\n- Block reward halved by time.\n- Difficulty adjusted every 1024 block.\n- Network difficulty.\n- GPU,Pool mining support predicted.\n\nNew version:\n- Block reward constant.\n- Difficulty adjusted every 16 block.\n- Personal & Network difficulty.\n- Token Holding and solo mining predicted.\n\nFunction which return your personal difficulty:\n\n     function discountedMiningTarget(address solver) public constant returns (uint256 discountedDiff) {\n        // the number of coins owned\n        uint256 minerBalance = uint256(balanceOf(solver));\n         \n        if(minerBalance <= 2 * _BLOCK_REWARD)\n            return getMiningTarget();\n            \n        // the number of full block rewards owned\n        uint256 minerDiscount = uint256(minerBalance.div(_BLOCK_REWARD));\n            \n        discountedDiff = miningTarget.mul(minerDiscount.mul(minerDiscount));\n        \n        if(discountedDiff > _MAXIMUM_TARGET) //very easy\n            discountedDiff = _MAXIMUM_TARGET;\n      \n        return discountedDiff;\n    }\n\n\nFull contract deployed: https://etherscan.io/address/0x1a136ae98b49b92841562b6574d1f3f5b0044e4c\n\nBitcointalk announcement: https://bitcointalk.org/index.php?topic=3180092.0\n\nP.S.: It was really conducive to prepare the Hardfork and create a new distribution logic. We learn a lot more about Solidity and the whole Eth ecosystem than ever before.", "permalink": "/r/ethereum/comments/87j7rx/we_enhanced_the_pow_erc20_token_distribution_and/", "title": "We enhanced the PoW ERC20 Token distribution and make it more inexpensive.", "created_utc": 1522163840.0, "url": "https://www.reddit.com/r/ethereum/comments/87j7rx/we_enhanced_the_pow_erc20_token_distribution_and/", "author": "janixwow"}, "87gkhl": {"subreddit": "r/ethtrader", "id": "87gkhl", "text": "I'd like to get some feedback on a small project http://ethpledge.com I've been working on the last few days. This is a smart contract and website where Ethereum users can pledge to donate a certain amount to an address (ideally a charity of some sort), which gets sent only if others match that amount. Upon creating a pledge to donate a certain amount to some address, the user sends that Ether to the EthPledge smart contract, and if others donate to that pledge too up to that amount of Ether it all gets sent to the charity address. You can also pledge to donate several times what others do (eg. you could put up 10 Ether, and say that if others donate only 2 Ether it'll all get sent to the charity address).\n\nIt is fairly common for companies to do giving pledges like this (\"we'll match anything employees donate to this charity\") and having something like this on the Ethereum blockchain makes it 100% transparent and by going through a smart contract can guarantee someone holds up their end of the bargain. There is at least one major international charity with an Ethereum address for donations, Heifer International (https://www.heifer.org/what-you-can-do/give/digital-currency.html) and I've created the first pledge on the website to donate 0.1 Ether to them: see http://www.ethpledge.com/id/0 :) (look at it while connected to the mainnet).\n\nShould you create a pledge and then cancel it, you'll get a refund of your pledge amount in line with how much others have donated - if you cancel the pledge when 10% of the donation target has been reached, for example, 10% of your pledge amount (along with the donations) will be sent to the charity address, and 90% of the pledge amount you put up will be returned to you.\n\nThe verified contract code is at https://etherscan.io/address/0x10ec03b714a2660581040c1a0329d88e381ca603 and I've also uploaded the code for the website/UI at https://github.com/wanshun123/EthPledge if that's of interest to anyone.\n\nFeedback and criticism very much welcome.", "permalink": "/r/ethtrader/comments/87gkhl/ethpledge_smart_contract_for_matching_charity/", "title": "EthPledge: Smart contract for matching charity donations (x/post /r/ethereum)", "created_utc": 1522136382.0, "url": "https://www.reddit.com/r/ethtrader/comments/87gkhl/ethpledge_smart_contract_for_matching_charity/", "author": "hanyuqn"}, "87lo5g": {"subreddit": "r/ethereum", "id": "87lo5g", "text": "", "permalink": "/r/ethereum/comments/87lo5g/opskins_welcomes_decentraland_opskins_marketplace/", "title": "OPSkins Welcomes Decentraland - OPSkins Marketplace Blog", "created_utc": 1522181201.0, "url": "https://blog.opskins.com/opskins-welcomes-decentraland/", "author": "dragonfrugal"}, "87fo4l": {"subreddit": "r/ethereum", "id": "87fo4l", "text": "", "permalink": "/r/ethereum/comments/87fo4l/what_the_sec_should_focus_on_with_crypto/", "title": "What The SEC Should Focus On With Crypto.", "created_utc": 1522125211.0, "url": "https://abovecrypto.com/all-posts/what-the-sec/", "author": "stulkenm"}, "87nnwp": {"subreddit": "r/ethtrader", "id": "87nnwp", "text": "Hi guys, let me introduce you to Blok, the new maestro in town, revolutionizing the global gig economy by leveraging blockchain to remove frictions impeding the on-demand workforce. \n\nThe gig economy, as well as, blockchain, are both booming at the moment, and will continue to grow for the foreseeable future. \n\nJust putting it out here if someone wants to target it for their next ICO investment, and be part of the next big thing.\n\nWebsite: https://blok.network\n\nFollow the sub: https://www.reddit.com/r/blok/\n\nJoin the conversation on Telegram: https://t.me/blokcommunity", "permalink": "/r/ethtrader/comments/87nnwp/blok_introduction_to_community/", "title": "Blok - Introduction to community", "created_utc": 1522197230.0, "url": "https://www.reddit.com/r/ethtrader/comments/87nnwp/blok_introduction_to_community/", "author": "a_blok"}, "87id33": {"subreddit": "r/ethtrader", "id": "87id33", "text": "I bought some ETH on Coinbase back in the summer when it was supported in Canada, now it is not. Is my best bet to transfer to GDAX or do you have any recommendations. I'd like to continue to HODL but may be looking to purchase more in the near future if this trend continues (which i no longer can on Coinbase). Thanks", "permalink": "/r/ethtrader/comments/87id33/canadian_on_coinbase_transfer_to_gdax/", "title": "Canadian on Coinbase, Transfer to GDAX?", "created_utc": 1522156878.0, "url": "https://www.reddit.com/r/ethtrader/comments/87id33/canadian_on_coinbase_transfer_to_gdax/", "author": "Vendetta1992"}, "87o4wo": {"subreddit": "r/ethtrader", "id": "87o4wo", "text": "", "permalink": "/r/ethtrader/comments/87o4wo/forkdelta_cofounder_forced_out_be_wary_of/", "title": "ForkDelta Co-Founder forced out, be wary of ForkDelta now : CryptoCurrency", "created_utc": 1522201573.0, "url": "https://www.reddit.com/r/cryptocurrency/comments/87o2jm/_/", "author": "dashrandom"}, "87o9r3": {"subreddit": "r/ethtrader", "id": "87o9r3", "text": "", "permalink": "/r/ethtrader/comments/87o9r3/this_has_been_the_longest_bear_market_ethereum/", "title": "This has been the longest bear market Ethereum has ever experienced by more than two fold. Is it really smart to sell now?", "created_utc": 1522202790.0, "url": "https://i.redd.it/npx7wpmlweo01.png", "author": "OperationNine"}, "87jm5e": {"subreddit": "r/ethtrader", "id": "87jm5e", "text": "", "permalink": "/r/ethtrader/comments/87jm5e/streamr_have_6_new_partners_in_the_bag_including/", "title": "Streamr have 6+ new partners in the bag including fortune 500 companies", "created_utc": 1522166823.0, "url": "https://twitter.com/streamrinc/status/978636406296891392?s=19", "author": "Jackykoh"}, "87gqe9": {"subreddit": "r/ethereum", "id": "87gqe9", "text": "", "permalink": "/r/ethereum/comments/87gqe9/play_crypto_racing_league_on_your_mobile_browser/", "title": "Play Crypto Racing League on your Mobile browser using Trust Wallet!", "created_utc": 1522138643.0, "url": "https://medium.com/@cryptoracingleague/play-crypto-racing-league-on-your-mobile-browser-using-trust-wallet-1fd4fff14fc4", "author": "kookiekrak"}}